[
  {
    "technique_id": "T1078.001",
    "technique_name": "Valid Accounts: Default Accounts",
    "description": "Adversaries may obtain and abuse credentials of a default account as a means of gaining Initial Access, Persistence, Privilege Escalation, or Defense Evasion. Default accounts are those that are built-into an OS, such as the Guest or Administrator accounts on Windows systems. Default accounts also include default factory/provider set accounts on other types of systems, software, or devices, including the root user account in AWS, the root user account in ESXi, and the default service account in Kubernetes. Default accounts are not limited to client machines; rather, they also include accounts that are preset for equipment such as network devices and computer applications, whether they are internal, open source, or commercial. Appliances that come preset with a username and password combination pose a serious threat to organizations that do not change it post installation, as they are easy targets for an adversary. Similarly, adversaries may also utilize publicly disclosed or stolen Private Keys or credential materials to legitimately connect to remote environments via Remote Services. Default accounts may be created on a system after initial setup by connecting or integrating it with another application. For example, when an ESXi server is connected to a vCenter server, a default privileged account called `vpxuser` is created on the ESXi server. If a threat actor is able to compromise this account’s credentials (for example, via Exploitation for Credential Access on the vCenter host), they will then have access to the ESXi server.",
    "detection": "Monitor whether default accounts have been activated or logged into. These audits should also include checks on any appliances and applications for default credentials or SSH keys, and if any are discovered, they should be updated immediately.",
    "procedures": [
      "[G1016] FIN13: FIN13 has leveraged default credentials for authenticating myWebMethods (WMS) and QLogic web management interface to gain initial access.",
      "[S0537] HyperStack: HyperStack can use default credentials to connect to IPC$ shares on remote machines.",
      "[C0038] HomeLand Justice: During HomeLand Justice, threat actors used the built-in administrator account to move laterally using RDP and Impacket.",
      "[G0059] Magic Hound: Magic Hound enabled and used the default system managed account, DefaultAccount, via `\"powershell.exe\" /c net user DefaultAccount /active:yes` to connect to a targeted Exchange server over RDP.",
      "[S0603] Stuxnet: Stuxnet infected WinCC machines via a hardcoded database server password.",
      "[G1003] Ember Bear: Ember Bear has abused default user names and passwords in externally-accessible IP cameras for initial access."
    ],
    "tactics": "TA0001 - Initial Access"
  },
  {
    "technique_id": "T1078.002",
    "technique_name": "Valid Accounts: Domain Accounts",
    "description": "Adversaries may obtain and abuse credentials of a domain account as a means of gaining Initial Access, Persistence, Privilege Escalation, or Defense Evasion. Domain accounts are those managed by Active Directory Domain Services where access and permissions are configured across systems and services that are part of that domain. Domain accounts can cover users, administrators, and services. Adversaries may compromise domain accounts, some with a high level of privileges, through various means such as OS Credential Dumping or password reuse, allowing access to privileged resources of the domain.",
    "detection": "Configure robust, consistent account activity audit policies across the enterprise and with externally accessible services. Look for suspicious account behavior across systems that share accounts, either user, admin, or service accounts. Examples: one account logged into multiple systems simultaneously; multiple accounts logged into the same machine simultaneously; accounts logged in at odd times or outside of business hours. Activity may be from interactive login sessions or process ownership from accounts being used to execute binaries on a remote system as a particular account. Correlate other security systems with login information (e.g., a user has an active login session but has not entered the building or does not have VPN access). On Linux, check logs and other artifacts created by use of domain authentication services, such as the System Security Services Daemon (sssd). Perform regular audits of domain accounts to detect accounts that may have been created by an adversary for persistence.",
    "procedures": [
      "[S1024] CreepySnail: CreepySnail can use stolen credentials to authenticate on target networks.",
      "[C0002] Night Dragon: During Night Dragon, threat actors used domain accounts to gain further access to victim systems.",
      "[C0023] Operation Ghost: For Operation Ghost, APT29 used stolen administrator credentials for lateral movement on compromised networks.",
      "[C0048] Operation MidnightEclipse: During Operation MidnightEclipse, threat actors used a compromised domain admin account to move laterally.",
      "[S0154] Cobalt Strike: Cobalt Strike can use known credentials to run commands and spawn processes as a domain user account.",
      "[G0019] Naikon: Naikon has used administrator credentials for lateral movement in compromised networks.",
      "[C0049] Leviathan Australian Intrusions: Leviathan compromised domain credentials during Leviathan Australian Intrusions.",
      "[C0012] Operation CuckooBees: During Operation CuckooBees, the threat actors used compromised domain administrator credentials as part of their lateral movement.",
      "[G1030] Agrius: Agrius attempted to acquire valid credentials for victim environments through various means to enable follow-on lateral movement.",
      "[G0102] Wizard Spider: Wizard Spider has used administrative accounts, including Domain Admin, to move laterally within a victim network.",
      "[G0034] Sandworm Team: Sandworm Team has used stolen credentials to access administrative accounts within the domain.",
      "[C0024] SolarWinds Compromise: During the SolarWinds Compromise, APT29 used domain administrators' accounts to help facilitate lateral movement on compromised networks.",
      "[S0446] Ryuk: Ryuk can use stolen domain admin accounts to move laterally within a victim domain.",
      "[G0049] OilRig: OilRig has used an exfiltration tool named STEALHOOK to retreive valid domain credentials.",
      "[S0140] Shamoon: If Shamoon cannot access shares using current privileges, it attempts access using hard coded, domain-specific credentials gathered earlier in the intrusion.",
      "[G1021] Cinnamon Tempest: Cinnamon Tempest has obtained highly privileged credentials such as domain administrator in order to deploy malware.",
      "[G1022] ToddyCat: ToddyCat has used compromised domain admin credentials to mount local network shares.",
      "[G0119] Indrik Spider: Indrik Spider has collected credentials from infected systems, including domain accounts.",
      "[G0022] APT3: APT3 leverages valid accounts after gaining credentials for use within the victim domain.",
      "[G0114] Chimera: Chimera has used compromised domain accounts to gain access to the target environment.",
      "[C0014] Operation Wocao: During Operation Wocao, threat actors used domain credentials, including domain admin, for lateral movement and privilege escalation.",
      "[G1040] Play: Play has used valid domain accounts for access.",
      "[G0092] TA505: TA505 has used stolen domain admin accounts to compromise additional hosts.",
      "[G0028] Threat Group-1314: Threat Group-1314 actors used compromised domain credentials for the victim's endpoint management platform, Altiris, to move laterally.",
      "[G1023] APT5: APT5 has used legitimate account credentials to move laterally through compromised environments.",
      "[G0059] Magic Hound: Magic Hound has used domain administrator accounts after dumping LSASS process memory.",
      "[C0029] Cutting Edge: During Cutting Edge, threat actors used compromised VPN accounts for lateral movement on targeted networks.",
      "[S0603] Stuxnet: Stuxnet attempts to access network resources with a domain account’s credentials.",
      "[G1017] Volt Typhoon: Volt Typhoon has used compromised domain accounts to authenticate to devices on compromised networks.",
      "[G1043] BlackByte: BlackByte captured credentials for or impersonated domain administration users.",
      "[G0143] Aquatic Panda: Aquatic Panda used multiple mechanisms to capture valid user accounts for victim domains to enable lateral movement and access to additional hosts in victim environments."
    ],
    "tactics": "TA0001 - Initial Access"
  },
  {
    "technique_id": "T1078.003",
    "technique_name": "Valid Accounts: Local Accounts",
    "description": "Adversaries may obtain and abuse credentials of a local account as a means of gaining Initial Access, Persistence, Privilege Escalation, or Defense Evasion. Local accounts are those configured by an organization for use by users, remote support, services, or for administration on a single system or service. Local Accounts may also be abused to elevate privileges and harvest credentials through OS Credential Dumping. Password reuse may allow the abuse of local accounts across a set of machines on a network for the purposes of Privilege Escalation and Lateral Movement.",
    "detection": "Perform regular audits of local system accounts to detect accounts that may have been created by an adversary for persistence. Look for suspicious account behavior, such as accounts logged in at odd times or outside of business hours.",
    "procedures": [
      "[G0094] Kimsuky: Kimsuky has used a tool called GREASE to add a Windows admin account in order to allow them continued access via RDP.",
      "[S0367] Emotet: Emotet can brute force a local admin password, then use it to facilitate lateral movement.",
      "[S0154] Cobalt Strike: Cobalt Strike can use known credentials to run commands and spawn processes as a local user account.",
      "[G0056] PROMETHIUM: PROMETHIUM has created admin accounts on a compromised host.",
      "[G0051] FIN10: FIN10 has moved laterally using the Local Administrator account.",
      "[G1040] Play: Play has used valid local accounts to gain initial access.",
      "[G0050] APT32: APT32 has used legitimate local admin account credentials.",
      "[G1041] Sea Turtle: Sea Turtle compromised cPanel accounts in victim environments.",
      "[G0081] Tropic Trooper: Tropic Trooper has used known administrator account credentials to execute the backdoor directly.",
      "[G0125] HAFNIUM: HAFNIUM has used the NT AUTHORITY\\SYSTEM account to create files on Exchange servers.",
      "[G0046] FIN7: FIN7 has used compromised credentials for access as SYSTEM on Exchange servers.",
      "[C0024] SolarWinds Compromise: During the SolarWinds Compromise, APT29 used compromised local accounts to access victims' networks.",
      "[C0049] Leviathan Australian Intrusions: Leviathan used captured local account information, such as service accounts, for actions during Leviathan Australian Intrusions.",
      "[G1047] Velvet Ant: Velvet Ant accessed vulnerable Cisco switch devices using accounts with administrator privileges.",
      "[G0016] APT29: APT29 targets dormant or inactive user accounts, accounts belonging to individuals no longer at the organization but whose accounts remain on the system, for access and persistence.",
      "[S0368] NotPetya: NotPetya can use valid credentials with PsExec or wmic to spread itself to remote systems.",
      "[S1202] LockBit 3.0: LockBit 3.0 can use a compromised local account for lateral movement.",
      "[S0221] Umbreon: Umbreon creates valid local users to provide access to the system.",
      "[C0014] Operation Wocao: During Operation Wocao, threat actors used local account credentials found during the intrusion for lateral movement and privilege escalation.",
      "[G0010] Turla: Turla has abused local accounts that have the same password across the victim’s network."
    ],
    "tactics": "TA0001 - Initial Access"
  },
  {
    "technique_id": "T1078.004",
    "technique_name": "Valid Accounts: Cloud Accounts",
    "description": "Valid accounts in cloud environments may allow adversaries to perform actions to achieve Initial Access, Persistence, Privilege Escalation, or Defense Evasion. Cloud accounts are those created and configured by an organization for use by users, remote support, services, or for administration of resources within a cloud service provider or SaaS application. Cloud Accounts can exist solely in the cloud; alternatively, they may be hybrid-joined between on-premises systems and the cloud through syncing or federation with other identity sources such as Windows Active Directory. Service or user accounts may be targeted by adversaries through Brute Force, Phishing, or various other means to gain access to the environment. Federated or synced accounts may be a pathway for the adversary to affect both on-premises systems and cloud environments - for example, by leveraging shared credentials to log onto Remote Services. High privileged cloud accounts, whether federated, synced, or cloud-only, may also allow pivoting to on-premises environments by leveraging SaaS-based Software Deployment Tools to run commands on hybrid-joined devices. An adversary may create long lasting Additional Cloud Credentials on a compromised cloud account to maintain persistence in the environment. Such credentials may also be used to bypass security controls such as multi-factor authentication. Cloud accounts may also be able to assume Temporary Elevated Cloud Access or other privileges through various means within the environment. Misconfigurations in role assignments or role assumption policies may allow an adversary to use these mechanisms to leverage permissions outside the intended scope of the account. Such over privileged accounts may be used to harvest sensitive data from online storage accounts and databases through Cloud API or other methods. For example, in Azure environments, adversaries may target Azure Managed Identities, which allow associated Azure resources to request access tokens. By compromising a resource with an attached Managed Identity, such as an Azure VM, adversaries may be able to Steal Application Access Tokens to move laterally across the cloud environment.",
    "detection": "Monitor the activity of cloud accounts to detect abnormal or malicious behavior, such as accessing information outside of the normal function of the account or account usage at atypical hours.",
    "procedures": [
      "[C0024] SolarWinds Compromise: During the SolarWinds Compromise, APT29 used a compromised O365 administrator account to create a new Service Principal.",
      "[G0016] APT29: APT29 has gained access to a global administrator account in Azure AD and has used `Service Principal` credentials in Exchange.",
      "[G1023] APT5: APT5 has accessed Microsoft M365 cloud environments using stolen credentials.",
      "[S0684] ROADTools: ROADTools leverages valid cloud credentials to perform enumeration operations using the internal Azure AD Graph API.",
      "[G0007] APT28: APT28 has used compromised Office 365 service accounts with Global Administrator privileges to collect email from user inboxes.",
      "[C0027] C0027: During C0027, Scattered Spider leveraged compromised credentials from victim users to authenticate to Azure tenants.",
      "[S0683] Peirates: Peirates can use stolen service account tokens to perform its operations.",
      "[G0125] HAFNIUM: HAFNIUM has abused service principals in compromised environments to enable data exfiltration.",
      "[S1091] Pacu: Pacu leverages valid cloud accounts to perform most of its operations.",
      "[G0064] APT33: APT33 has used compromised Office 365 accounts in tandem with Ruler in an attempt to gain control of endpoints.",
      "[G1004] LAPSUS$: LAPSUS$ has used compromised credentials to access cloud assets within a target organization.",
      "[G0004] Ke3chang: Ke3chang has used compromised credentials to sign into victims’ Microsoft 365 accounts."
    ],
    "tactics": "TA0001 - Initial Access"
  },
  {
    "technique_id": "T1091",
    "technique_name": "Replication Through Removable Media",
    "description": "Adversaries may move onto systems, possibly those on disconnected or air-gapped networks, by copying malware to removable media and taking advantage of Autorun features when the media is inserted into a system and executes. In the case of Lateral Movement, this may occur through modification of executable files stored on removable media or by copying malware and renaming it to look like a legitimate file to trick users into executing it on a separate system. In the case of Initial Access, this may occur through manual manipulation of the media, modification of systems used to initially format the media, or modification to the media's firmware itself. Mobile devices may also be used to infect PCs with malware if connected via USB. This infection may be achieved using devices (Android, iOS, etc.) and, in some instances, USB charging cables. For example, when a smartphone is connected to a system, it may appear to be mounted similar to a USB-connected disk drive. If malware that is compatible with the connected system is on the mobile device, the malware could infect the machine (especially if Autorun features are enabled).",
    "detection": "Monitor file access on removable media. Detect processes that execute from removable media after it is mounted or when initiated by a user. If a remote access tool is used in this manner to move laterally, then additional actions are likely to occur after execution, such as opening network connections for Command and Control and system and network information Discovery.",
    "procedures": [
      "[S0143] Flame: Flame contains modules to infect USB sticks and spread laterally to other Windows systems the stick is plugged into using Autorun functionality.",
      "[S0028] SHIPSHAPE: APT30 may have used the SHIPSHAPE malware to move onto air-gapped networks. SHIPSHAPE targets removable drives to spread to other systems by modifying the drive to use Autorun to execute or by hiding legitimate document files and copying an executable to the folder with the same name as the legitimate document.",
      "[G1014] LuminousMoth: LuminousMoth has used malicious DLLs to spread malware to connected removable USB drives on infected machines.",
      "[S0130] Unknown Logger: Unknown Logger is capable of spreading to USB devices.",
      "[G1007] Aoqin Dragon: Aoqin Dragon has used a dropper that employs a worm infection strategy using a removable device to breach a secure network environment.",
      "[S0062] DustySky: DustySky searches for removable media and duplicates itself onto it.",
      "[S0132] H1N1: H1N1 has functionality to copy itself to removable media.",
      "[G0012] Darkhotel: Darkhotel's selective infector modifies executables stored on removable media as a method of spreading across computers.",
      "[S0603] Stuxnet: Stuxnet can propagate via removable media using an autorun.inf file or the CVE-2010-2568 LNK vulnerability.",
      "[G0129] Mustang Panda: Mustang Panda has used a customized PlugX variant which could spread through USB connections.",
      "[S1130] Raspberry Robin: Raspberry Robin has historically used infected USB media to spread to new victims.",
      "[S0092] Agent.btz: Agent.btz drops itself onto removable media devices and creates an autorun.inf file with an instruction to run that file. When the device is inserted into another system, it opens autorun.inf and loads the malware.",
      "[S0385] njRAT: njRAT can be configured to spread via removable drives.",
      "[S0452] USBferry: USBferry can copy its installer to attached USB storage devices.",
      "[S0023] CHOPSTICK: Part of APT28's operation involved using CHOPSTICK modules to copy itself to air-gapped machines and using files written to USB sticks to transfer data and command traffic.",
      "[S0115] Crimson: Crimson can spread across systems by infecting removable media.",
      "[G0046] FIN7: FIN7 actors have mailed USB drives to potential victims containing malware that downloads and installs various backdoors, including in some cases for ransomware operations.",
      "[S0458] Ramsay: Ramsay can spread itself by infecting other portable executable files on removable drives.",
      "[S0650] QakBot: QakBot has the ability to use removable drives to spread through compromised networks.",
      "[S1074] ANDROMEDA: ANDROMEDA has been spread via infected USB keys.",
      "[S0136] USBStealer: USBStealer drops itself onto removable media and relies on Autorun to execute the malicious file when a user opens the removable media on another system.",
      "[G0007] APT28: APT28 uses a tool to infect connected USB devices and transmit itself to air-gapped computers when the infected USB device is inserted.",
      "[S0608] Conficker: Conficker variants used the Windows AUTORUN feature to spread through USB propagation.",
      "[S0386] Ursnif: Ursnif has copied itself to and infected removable drives for propagation.",
      "[G0081] Tropic Trooper: Tropic Trooper has attempted to transfer USBferry from an infected USB device by copying an Autorun function to the target machine."
    ],
    "tactics": "TA0001 - Initial Access"
  },
  {
    "technique_id": "T1133",
    "technique_name": "External Remote Services",
    "description": "Adversaries may leverage external-facing remote services to initially access and/or persist within a network. Remote services such as VPNs, Citrix, and other access mechanisms allow users to connect to internal enterprise network resources from external locations. There are often remote service gateways that manage connections and credential authentication for these services. Services such as Windows Remote Management and VNC can also be used externally. Access to Valid Accounts to use the service is often a requirement, which could be obtained through credential pharming or by obtaining the credentials from users after compromising the enterprise network. Access to remote services may be used as a redundant or persistent access mechanism during an operation. Access may also be gained through an exposed service that doesn’t require authentication. In containerized environments, this may include an exposed Docker API, Kubernetes API server, kubelet, or web application such as the Kubernetes dashboard.",
    "detection": "Follow best practices for detecting adversary use of Valid Accounts for authenticating to remote services. Collect authentication logs and analyze for unusual access patterns, windows of activity, and access outside of normal business hours. When authentication is not required to access an exposed remote service, monitor for follow-on activities such as anomalous external use of the exposed API or application.",
    "procedures": [
      "[G0139] TeamTNT: TeamTNT has used open-source tools such as Weave Scope to target exposed Docker API ports and gain initial access to victim environments. TeamTNT has also targeted exposed kubelets for Kubernetes environments.",
      "[G1016] FIN13: FIN13 has gained access to compromised environments via remote access services such as the corporate virtual private network (VPN).",
      "[C0012] Operation CuckooBees: During Operation CuckooBees, the threat actors enabled WinRM over HTTP/HTTPS as a backup persistence mechanism using the following command: `cscript //nologo \"C:\\Windows\\System32\\winrm.vbs\" set winrm/config/service@{EnableCompatibilityHttpsListener=\"true\"}`.",
      "[S0362] Linux Rabbit: Linux Rabbit attempts to gain access to the server via SSH.",
      "[C0002] Night Dragon: During Night Dragon, threat actors used compromised VPN accounts to gain access to victim systems.",
      "[S1060] Mafalda: Mafalda can establish an SSH connection from a compromised host to a server.",
      "[G1003] Ember Bear: Ember Bear have used VPNs both for initial access to victim environments and for persistence within them following compromise.",
      "[G0026] APT18: APT18 actors leverage legitimate credentials to log into external remote services.",
      "[G0034] Sandworm Team: Sandworm Team has used Dropbear SSH with a hardcoded backdoor password to maintain persistence within the target network. Sandworm Team has also used VPN tunnels established in legitimate software company infrastructure to gain access to internal networks of that software company's users.",
      "[G1017] Volt Typhoon: Volt Typhoon has used VPNs to connect to victim environments and enable post-exploitation actions.",
      "[G1047] Velvet Ant: Velvet Ant has leveraged access to internet-facing remote services to compromise and retain access to victim environments.",
      "[S0601] Hildegard: Hildegard was executed through an unsecure kubelet that allowed anonymous access to the victim environment.",
      "[G1015] Scattered Spider: Scattered Spider has leveraged legitimate remote management tools to maintain persistent access.",
      "[G0096] APT41: APT41 compromised an online billing/payment service using VPN access between a third-party service provider and the targeted payment service.",
      "[G1004] LAPSUS$: LAPSUS$ has gained access to internet-facing systems and applications, including virtual private network (VPN), remote desktop protocol (RDP), and virtual desktop infrastructure (VDI) including Citrix.",
      "[G0049] OilRig: OilRig uses remote services such as VPN, Citrix, or OWA to persist in an environment.",
      "[G0093] GALLIUM: GALLIUM has used VPN services, including SoftEther VPN, to access and maintain persistence in victim environments.",
      "[G0004] Ke3chang: Ke3chang has gained access through VPNs including with compromised accounts and stolen VPN certificates.",
      "[C0028] 2015 Ukraine Electric Power Attack: During the 2015 Ukraine Electric Power Attack, Sandworm Team installed a modified Dropbear SSH client as the backdoor to target systems.",
      "[G0102] Wizard Spider: Wizard Spider has accessed victim networks by using stolen credentials to access the corporate VPN infrastructure.",
      "[G0016] APT29: APT29 has used compromised identities to access networks via VPNs and Citrix.",
      "[C0004] CostaRicto: During CostaRicto, the threat actors set up remote tunneling using an SSH tool to maintain access to a compromised environment.",
      "[G0094] Kimsuky: Kimsuky has used RDP to establish persistence.",
      "[G0053] FIN5: FIN5 has used legitimate VPN, Citrix, or VNC credentials to maintain access to a victim environment.",
      "[C0024] SolarWinds Compromise: For the SolarWinds Compromise, APT29 used compromised identities to access networks via SSH, VPNs, and other remote access tools.",
      "[G0027] Threat Group-3390: Threat Group-3390 actors look for and use VPN profiles during an operation to access the network using external VPN services. Threat Group-3390 has also obtained OWA account credentials during intrusions that it subsequently used to attempt to regain access when evicted from a victim network.",
      "[G1041] Sea Turtle: Sea Turtle has used external-facing SSH to achieve initial access to the IT environments of victim organizations.",
      "[S0599] Kinsing: Kinsing was executed in an Ubuntu container deployed via an open Docker daemon API.",
      "[C0027] C0027: During C0027, Scattered Spider used Citrix and VPNs to persist in compromised environments.",
      "[G0115] GOLD SOUTHFIELD: GOLD SOUTHFIELD has used publicly-accessible RDP and remote management and monitoring (RMM) servers to gain access to victim machines.",
      "[G0114] Chimera: Chimera has used legitimate credentials to login to an external VPN, Citrix, SSH, and other remote services.",
      "[C0032] C0032: During the C0032 campaign, TEMP.Veles used VPN access to persist in the victim environment.",
      "[G0035] Dragonfly: Dragonfly has used VPNs and Outlook Web Access (OWA) to maintain access to victim networks.",
      "[G1024] Akira: Akira uses compromised VPN accounts for initial access to victim networks.",
      "[G0007] APT28: APT28 has used Tor and a variety of commercial VPN services to route brute force authentication attempts.",
      "[G1040] Play: Play has used Remote Desktop Protocol (RDP) and Virtual Private Networks (VPN) for initial access.",
      "[C0014] Operation Wocao: During Operation Wocao, threat actors used stolen credentials to connect to the victim's network via VPN.",
      "[C0046] ArcaneDoor: ArcaneDoor used WebVPN sessions commonly associated with Clientless SSLVPN services to communicate to compromised devices.",
      "[S0600] Doki: Doki was executed through an open Docker daemon API port.",
      "[G0065] Leviathan: Leviathan has used external remote services such as virtual private networks (VPN) to gain initial access."
    ],
    "tactics": "TA0001 - Initial Access"
  },
  {
    "technique_id": "T1189",
    "technique_name": "Drive-by Compromise",
    "description": "Adversaries may gain access to a system through a user visiting a website over the normal course of browsing. Multiple ways of delivering exploit code to a browser exist (i.e., Drive-by Target), including: * A legitimate website is compromised, allowing adversaries to inject malicious code * Script files served to a legitimate website from a publicly writeable cloud storage bucket are modified by an adversary * Malicious ads are paid for and served through legitimate ad providers (i.e., Malvertising) * Built-in web application interfaces that allow user-controllable content are leveraged for the insertion of malicious scripts or iFrames (e.g., cross-site scripting) Browser push notifications may also be abused by adversaries and leveraged for malicious code injection via User Execution. By clicking \"allow\" on browser push notifications, users may be granting a website permission to run JavaScript code on their browser. Often the website used by an adversary is one visited by a specific community, such as government, a particular industry, or a particular region, where the goal is to compromise a specific user or set of users based on a shared interest. This kind of targeted campaign is often referred to a strategic web compromise or watering hole attack. There are several known examples of this occurring. Typical drive-by compromise process: 1. A user visits a website that is used to host the adversary controlled content. 2. Scripts automatically execute, typically searching versions of the browser and plugins for a potentially vulnerable version. The user may be required to assist in this process by enabling scripting, notifications, or active website components and ignoring warning dialog boxes. 3. Upon finding a vulnerable version, exploit code is delivered to the browser. 4. If exploitation is successful, the adversary will gain code execution on the user's system unless other protections are in place. In some cases, a second visit to the website after the initial scan is required before exploit code is delivered. Unlike Exploit Public-Facing Application, the focus of this technique is to exploit software on a client endpoint upon visiting a website. This will commonly give an adversary access to systems on the internal network instead of external systems that may be in a DMZ.",
    "detection": "Firewalls and proxies can inspect URLs for potentially known-bad domains or parameters. They can also do reputation-based analytics on websites and their requested resources such as how old a domain is, who it's registered to, if it's on a known bad list, or how many other users have connected to it before. Network intrusion detection systems, sometimes with SSL/TLS inspection, can be used to look for known malicious scripts (recon, heap spray, and browser identification scripts have been frequently reused), common script obfuscation, and exploit code. Detecting compromise based on the drive-by exploit from a legitimate website may be difficult. Also look for behavior on the endpoint system that might indicate successful compromise, such as abnormal behavior of browser processes. This could include suspicious files written to disk, evidence of Process Injection for attempts to hide execution, evidence of Discovery, or other unusual network traffic that may indicate additional tools transferred to the system.",
    "procedures": [
      "[G0134] Transparent Tribe: Transparent Tribe has used websites with malicious hyperlinks and iframes to infect targeted victims with Crimson, njRAT, and other malicious tools.",
      "[G0048] RTM: RTM has distributed its malware via the RIG and SUNDOWN exploit kits, as well as online advertising network Yandex.Direct.",
      "[G0068] PLATINUM: PLATINUM has sometimes used drive-by attacks against vulnerable browser plugins.",
      "[G0112] Windshift: Windshift has used compromised websites to register custom URL schemes on a remote system.",
      "[S0215] KARAE: KARAE was distributed through torrent file-sharing websites to South Korean victims, using a YouTube video downloader application as a lure.",
      "[S0483] IcedID: IcedID has cloned legitimate websites/applications to distribute the malware.",
      "[G1006] Earth Lusca: Earth Lusca has performed watering hole attacks.",
      "[G0082] APT38: APT38 has conducted watering holes schemes to gain initial access to victims.",
      "[S0482] Bundlore: Bundlore has been spread through malicious advertisements on websites.",
      "[G0001] Axiom: Axiom has used watering hole attacks to gain access.",
      "[G0073] APT19: APT19 performed a watering hole attack on forbes.com in 2014 to compromise targets.",
      "[G0012] Darkhotel: Darkhotel used embedded iframes on hotel login portals to redirect selected victims to download malware.",
      "[G0138] Andariel: Andariel has used watering hole attacks, often with zero-day exploits, to gain initial access to victims within a specific IP range.",
      "[G0007] APT28: APT28 has compromised targets via strategic web compromise utilizing custom exploit kits. APT28 used reflected cross-site scripting (XSS) against government websites to redirect users to phishing webpages.",
      "[G0035] Dragonfly: Dragonfly has compromised targets via strategic web compromise (SWC) utilizing a custom exploit kit.",
      "[S0606] Bad Rabbit: Bad Rabbit spread through watering holes on popular sites by injecting JavaScript into the HTML body or a .js file.",
      "[G0070] Dark Caracal: Dark Caracal leveraged a watering hole to serve up malicious code.",
      "[G0010] Turla: Turla has infected victims using watering holes.",
      "[G0040] Patchwork: Patchwork has used watering holes to deliver files with exploits to initial victims.",
      "[G0065] Leviathan: Leviathan has infected victims using watering holes.",
      "[G0050] APT32: APT32 has infected victims by tricking them into visiting compromised watering hole websites.",
      "[G0060] BRONZE BUTLER: BRONZE BUTLER compromised three Japanese websites using a Flash exploit to perform watering hole attacks.",
      "[C0016] Operation Dust Storm: During Operation Dust Storm, the threat actors used a watering hole attack on a popular software reseller to exploit the then-zero-day Internet Explorer vulnerability CVE-2014-0322.",
      "[G0032] Lazarus Group: Lazarus Group delivered RATANKBA and other malicious code to victims via a compromised legitimate website.",
      "[G0027] Threat Group-3390: Threat Group-3390 has extensively used strategic web compromises to target victims.",
      "[C0010] C0010: During C0010, UNC3890 actors likely established a watering hole that was hosted on a login page of a legitimate Israeli shipping company that was active until at least November 2021.",
      "[S0451] LoudMiner: LoudMiner is typically bundled with pirated copies of Virtual Studio Technology (VST) for Windows and macOS.",
      "[G1035] Winter Vivern: Winter Vivern created dedicated web pages mimicking legitimate government websites to deliver malicious fake anti-virus software.",
      "[S1124] SocGholish: SocGholish has been distributed through compromised websites with malicious content often masquerading as browser updates.",
      "[G0066] Elderwood: Elderwood has delivered zero-day exploits and malware to victims by injecting malicious code into specific public Web pages visited by targets within a particular sector.",
      "[S0496] REvil: REvil has infected victim machines through compromised websites and exploit kits.",
      "[G1020] Mustard Tempest: Mustard Tempest has used drive-by downloads for initial infection, often using fake browser updates as a lure.",
      "[G0067] APT37: APT37 has used strategic web compromises, particularly of South Korean websites, to distribute malware. The group has also used torrent file-sharing sites to more indiscriminately disseminate malware to victims. As part of their compromises, the group has used a Javascript based profiler called RICECURRY to profile a victim's web browser and deliver malicious code accordingly.",
      "[G0077] Leafminer: Leafminer has infected victims using watering holes.",
      "[S0531] Grandoreiro: Grandoreiro has used compromised websites and Google Ads to bait victims into downloading its installer.",
      "[G0095] Machete: Machete has distributed Machete through a fake blog website.",
      "[G1012] CURIUM: CURIUM has used strategic website compromise to infect victims with malware such as IMAPLoader.",
      "[S1086] Snip3: Snip3 has been delivered to targets via downloads from malicious domains.",
      "[G1034] Daggerfly: Daggerfly has used strategic website compromise for initial access against victims.",
      "[G0056] PROMETHIUM: PROMETHIUM has used watering hole attacks to deliver malicious versions of legitimate installers.",
      "[S0216] POORAIM: POORAIM has been delivered through compromised sites acting as watering holes.",
      "[G0124] Windigo: Windigo has distributed Windows malware via drive-by downloads.",
      "[G0059] Magic Hound: Magic Hound has conducted watering-hole attacks through media and magazine websites."
    ],
    "tactics": "TA0001 - Initial Access"
  },
  {
    "technique_id": "T1190",
    "technique_name": "Exploit Public-Facing Application",
    "description": "Adversaries may attempt to exploit a weakness in an Internet-facing host or system to initially access a network. The weakness in the system can be a software bug, a temporary glitch, or a misconfiguration. Exploited applications are often websites/web servers, but can also include databases (like SQL), standard services (like SMB or SSH), network device administration and management protocols (like SNMP and Smart Install), and any other system with Internet-accessible open sockets. On ESXi infrastructure, adversaries may exploit exposed OpenSLP services; they may alternatively exploit exposed VMware vCenter servers. Depending on the flaw being exploited, this may also involve Exploitation for Defense Evasion or Exploitation for Client Execution. If an application is hosted on cloud-based infrastructure and/or is containerized, then exploiting it may lead to compromise of the underlying instance or container. This can allow an adversary a path to access the cloud or container APIs (e.g., via the Cloud Instance Metadata API), exploit container host access via Escape to Host, or take advantage of weak identity and access management policies. Adversaries may also exploit edge network infrastructure and related appliances, specifically targeting devices that do not support robust host-based defenses. For websites and databases, the OWASP top 10 and CWE top 25 highlight the most common web-based vulnerabilities.",
    "detection": "Monitor application logs for abnormal behavior that may indicate attempted or successful exploitation. Use deep packet inspection to look for artifacts of common exploit traffic, such as SQL injection. Web Application Firewalls may detect improper inputs attempting exploitation.",
    "procedures": [
      "[C0027] C0027: During C0027, Scattered Spider exploited CVE-2021-35464 in the ForgeRock Open Access Management (OpenAM) application server to gain initial access.",
      "[G0106] Rocke: Rocke exploited Apache Struts, Oracle WebLogic (CVE-2017-10271), and Adobe ColdFusion (CVE-2017-3066) vulnerabilities to deliver malware.",
      "[C0039] Versa Director Zero Day Exploitation: Versa Director Zero Day Exploitation involved exploitation of a vulnerability in Versa Director servers, since identified as CVE-2024-39717, for initial access and code execution.",
      "[C0045] ShadowRay: During ShadowRay, threat actors exploited CVE-2023-48022 on publicly exposed Ray servers to steal computing power and to expose sensitive data.",
      "[G0027] Threat Group-3390: Threat Group-3390 has exploited the Microsoft SharePoint vulnerability CVE-2019-0604 and CVE-2021-26855, CVE-2021-26857, CVE-2021-26858, and CVE-2021-27065 in Exchange Server.",
      "[G0046] FIN7: FIN7 has compromised targeted organizations through exploitation of CVE-2021-31207 in Exchange.",
      "[C0018] C0018: During C0018, the threat actors exploited VMWare Horizon Unified Access Gateways that were vulnerable to several Log4Shell vulnerabilities, including CVE-2021-44228, CVE-2021-45046, CVE-2021-45105, and CVE-2021-44832.",
      "[S0623] Siloscape: Siloscape is executed after the attacker gains initial access to a Windows container using a known vulnerability.",
      "[G1017] Volt Typhoon: Volt Typhoon has gained initial access through exploitation of multiple vulnerabilities in internet-facing software and appliances such as Fortinet, Ivanti (formerly Pulse Secure), NETGEAR, Citrix, and Cisco.",
      "[G0034] Sandworm Team: Sandworm Team exploits public-facing applications for initial access and to acquire infrastructure, such as exploitation of the EXIM mail transfer agent in Linux systems.",
      "[G0007] APT28: APT28 has used a variety of public exploits, including CVE 2020-0688 and CVE 2020-17144, to gain execution on vulnerable Microsoft Exchange; they have also conducted SQL injection attacks against external websites.",
      "[G0094] Kimsuky: Kimsuky has exploited various vulnerabilities for initial access, including Microsoft Exchange vulnerability CVE-2020-0688.",
      "[G1003] Ember Bear: Ember Bear gains initial access to victim environments by exploiting external-facing services. Examples include exploitation of CVE-2021-26084 in Confluence servers; CVE-2022-41040, ProxyShell, and other vulnerabilities in Microsoft Exchange; and multiple vulnerabilities in open-source platforms such as content management systems.",
      "[C0014] Operation Wocao: During Operation Wocao, threat actors gained initial access by exploiting vulnerabilities in JBoss webservers.",
      "[C0002] Night Dragon: During Night Dragon, threat actors used SQL injection exploits against extranet web servers to gain access.",
      "[C0017] C0017: During C0017, APT41 exploited CVE-2021-44207 in the USAHerds application and CVE-2021-44228 in Log4j, as well as other .NET deserialization, SQL injection, and directory traversal vulnerabilities to gain initial access.",
      "[G0135] BackdoorDiplomacy: BackdoorDiplomacy has exploited CVE-2020-5902, an F5 BIP-IP vulnerability, to drop a Linux backdoor. BackdoorDiplomacy has also exploited mis-configured Plesk servers.",
      "[G0115] GOLD SOUTHFIELD: GOLD SOUTHFIELD has exploited Oracle WebLogic vulnerabilities for initial compromise.",
      "[G1016] FIN13: FIN13 has exploited known vulnerabilities such as CVE-2017-1000486 (Primefaces Application Expression Language Injection), CVE-2015-7450 (WebSphere Application Server SOAP Deserialization Exploit), CVE-2010-5326 (SAP NewWeaver Invoker Servlet Exploit), and EDB-ID-24963 (SAP NetWeaver ConfigServlet Remote Code Execution) to gain initial access.",
      "[G0098] BlackTech: BlackTech has exploited a buffer overflow vulnerability in Microsoft Internet Information Services (IIS) 6.0, CVE-2017-7269, in order to establish a new HTTP or command and control (C2) server.",
      "[S0225] sqlmap: sqlmap can be used to automate exploitation of SQL injection vulnerabilities.",
      "[G0059] Magic Hound: Magic Hound has exploited the Log4j utility (CVE-2021-44228), on-premises MS Exchange servers via \"ProxyShell\" (CVE-2021-34473, CVE-2021-34523, CVE-2021-31207), and Fortios SSL VPNs (CVE-2018-13379).",
      "[C0049] Leviathan Australian Intrusions: Leviathan exploited public-facing web applications and appliances for initial access during Leviathan Australian Intrusions.",
      "[C0038] HomeLand Justice: For HomeLand Justice, threat actors exploited CVE-2019-0604 in Microsoft SharePoint for initial access.",
      "[C0048] Operation MidnightEclipse: During Operation MidnightEclipse, threat actors exploited CVE-2024-3400 in Palo Alto Networks GlobalProtect.",
      "[S0516] SoreFang: SoreFang can gain access by exploiting a Sangfor SSL VPN vulnerability that allows for the placement and delivery of malicious update binaries.",
      "[G1041] Sea Turtle: Sea Turtle gained access to victim environments by exploiting multiple known vulnerabilities over several campaigns.",
      "[S0412] ZxShell: ZxShell has been dropped through exploitation of CVE-2011-2462, CVE-2013-3163, and CVE-2014-0322.",
      "[S1105] COATHANGER: COATHANGER is installed following exploitation of a vulnerable FortiGate device.",
      "[G0117] Fox Kitten: Fox Kitten has exploited known vulnerabilities in Fortinet, PulseSecure, and Palo Alto VPN appliances.",
      "[G1021] Cinnamon Tempest: Cinnamon Tempest has exploited multiple unpatched vulnerabilities for initial access including vulnerabilities in Microsoft Exchange, Manage Engine AdSelfService Plus, Confluence, and Log4j.",
      "[G1043] BlackByte: BlackByte exploited vulnerabilities such as ProxyLogon and ProxyShell for initial access to victim environments.",
      "[G0004] Ke3chang: Ke3chang has compromised networks by exploiting Internet-facing applications, including vulnerable Microsoft Exchange and SharePoint servers.",
      "[C0052] SPACEHOP Activity: SPACEHOP Activity has enabled the exploitation of CVE-2022-27518 and CVE-2022-27518 for illegitimate access.",
      "[C0012] Operation CuckooBees: During Operation CuckooBees, the threat actors exploited multiple vulnerabilities in externally facing servers.",
      "[G1030] Agrius: Agrius exploits public-facing applications for initial access to victim environments. Examples include widespread attempts to exploit CVE-2018-13379 in FortiOS devices and SQL injection activity.",
      "[C0024] SolarWinds Compromise: During the SolarWinds Compromise, APT29 exploited CVE-2020-0688 against the Microsoft Exchange Control Panel to regain access to a network.",
      "[C0029] Cutting Edge: During Cutting Edge, threat actors exploited CVE-2023-46805 and CVE-2024-21887 in Ivanti Connect Secure VPN appliances to enable authentication bypass and command injection. A server-side request forgery (SSRF) vulnerability, CVE-2024-21893, was identified later and used to bypass mitigations for the initial two vulnerabilities by chaining with CVE-2024-21887.",
      "[G0045] menuPass: menuPass has leveraged vulnerabilities in Pulse Secure VPNs to hijack sessions.",
      "[G1022] ToddyCat: ToddyCat has exploited the ProxyLogon vulnerability (CVE-2021-26855) to compromise Exchange Servers at multiple organizations.",
      "[G0108] Blue Mockingbird: Blue Mockingbird has gained initial access by exploiting CVE-2019-18935, a vulnerability within Telerik UI for ASP.NET AJAX.",
      "[S1184] BOLDMOVE: BOLDMOVE is associated with exploitation of CVE-2022-49475 in FortiOS.",
      "[G0093] GALLIUM: GALLIUM exploited a publicly-facing servers including Wildfly/JBoss servers to gain access to the network.",
      "[C0053] FLORAHOX Activity: FLORAHOX Activity has exploited and infected vulnerable routers to recruit additional network devices into the ORB.",
      "[G1035] Winter Vivern: Winter Vivern has exploited known and zero-day vulnerabilities in software usch as Roundcube Webmail servers and the \"Follina\" vulnerability.",
      "[G1006] Earth Lusca: Earth Lusca has compromised victims by directly exploiting vulnerabilities of public-facing servers, including those associated with Microsoft Exchange and Oracle GlassFish.",
      "[C0046] ArcaneDoor: ArcaneDoor abused WebVPN traffic to targeted devices to achieve unauthorized remote code execution.",
      "[G0016] APT29: APT29 has exploited CVE-2019-19781 for Citrix, CVE-2019-11510 for Pulse Secure VPNs, CVE-2018-13379 for FortiGate VPNs, and CVE-2019-9670 in Zimbra software to gain access.",
      "[G0065] Leviathan: Leviathan has used exploits against publicly-disclosed vulnerabilities for initial access into victim networks.",
      "[G0123] Volatile Cedar: Volatile Cedar has targeted publicly facing web servers, with both automatic and manual vulnerability discovery.",
      "[G1032] INC Ransom: INC Ransom has exploited known vulnerabilities including CVE-2023-3519 in Citrix NetScaler for initial access.",
      "[S0224] Havij: Havij is used to automate SQL injection.",
      "[G1009] Moses Staff: Moses Staff has exploited known vulnerabilities in public-facing infrastructure such as Microsoft Exchange Servers.",
      "[G0035] Dragonfly: Dragonfly has conducted SQL injection attacks, exploited vulnerabilities CVE-2019-19781 and CVE-2020-0688 for Citrix and MS Exchange, and CVE-2018-13379 for Fortinet VPNs.",
      "[G0001] Axiom: Axiom has been observed using SQL injection to gain access to systems.",
      "[G0096] APT41: APT41 exploited CVE-2020-10189 against Zoho ManageEngine Desktop Central through unsafe deserialization, and CVE-2019-19781 to compromise Citrix Application Delivery Controllers (ADC) and gateway devices. APT41 leveraged vulnerabilities such as ProxyLogon exploitation or SQL injection for initial access. APT41 exploited CVE-2021-26855 against a vulnerable Microsoft Exchange Server to gain initial access to the victim network.",
      "[G1040] Play: Play has exploited known vulnerabilities for initial access including CVE-2018-13379 and CVE-2020-12812 in FortiOS and CVE-2022-41082 and CVE-2022-41040 (\"ProxyNotShell\") in Microsoft Exchange.",
      "[C0041] FrostyGoop Incident: FrostyGoop Incident was likely enabled by the adversary exploiting an unknown vulnerability in an external-facing router.",
      "[G0125] HAFNIUM: HAFNIUM has exploited multiple vulnerabilities to compromise edge devices and on-premises versions of Microsoft Exchange Server.",
      "[G1023] APT5: APT5 has exploited vulnerabilities in externally facing software and devices including Pulse Secure VPNs and Citrix Application Delivery Controllers.",
      "[G0069] MuddyWater: MuddyWater has exploited the Microsoft Exchange memory corruption vulnerability (CVE-2020-0688).",
      "[G1045] Salt Typhoon: Salt Typhoon has exploited CVE-2018-0171 in the Smart Install feature of Cisco IOS and Cisco IOS XE software for initial access.",
      "[G0087] APT39: APT39 has used SQL injection for initial compromise."
    ],
    "tactics": "TA0001 - Initial Access"
  },
  {
    "technique_id": "T1195.001",
    "technique_name": "Supply Chain Compromise: Compromise Software Dependencies and Development Tools",
    "description": "Adversaries may manipulate software dependencies and development tools prior to receipt by a final consumer for the purpose of data or system compromise. Applications often depend on external software to function properly. Popular open source projects that are used as dependencies in many applications may be targeted as a means to add malicious code to users of the dependency. Targeting may be specific to a desired victim set or may be distributed to a broad set of consumers but only move on to additional tactics on specific victims.",
    "detection": "Use verification of distributed binaries through hash checking or other integrity checking mechanisms. Scan downloads for malicious signatures and attempt to test software and updates prior to deployment while taking note of potential suspicious activity.",
    "procedures": [
      "[S0658] XCSSET: XCSSET adds malicious code to a host's Xcode projects by enumerating CocoaPods target_integrator.rb files under the /Library/Ruby/Gems folder or enumerates all .xcodeproj folders under a given directory. XCSSET then downloads a script and Mach-O file into the Xcode project folder."
    ],
    "tactics": "TA0001 - Initial Access"
  },
  {
    "technique_id": "T1195.002",
    "technique_name": "Supply Chain Compromise: Compromise Software Supply Chain",
    "description": "Adversaries may manipulate application software prior to receipt by a final consumer for the purpose of data or system compromise. Supply chain compromise of software can take place in a number of ways, including manipulation of the application source code, manipulation of the update/distribution mechanism for that software, or replacing compiled releases with a modified version. Targeting may be specific to a desired victim set or may be distributed to a broad set of consumers but only move on to additional tactics on specific victims.",
    "detection": "Use verification of distributed binaries through hash checking or other integrity checking mechanisms. Scan downloads for malicious signatures and attempt to test software and updates prior to deployment while taking note of potential suspicious activity.",
    "procedures": [
      "[G0096] APT41: APT41 gained access to production environments where they could inject malicious code into legitimate, signed files and widely distribute them to end users.",
      "[G0080] Cobalt Group: Cobalt Group has compromised legitimate web browser updates to deliver a backdoor.",
      "[G0115] GOLD SOUTHFIELD: GOLD SOUTHFIELD has distributed ransomware by backdooring software installers via a strategic web compromise of the site hosting Italian WinRAR.",
      "[S0493] GoldenSpy: GoldenSpy has been packaged with a legitimate tax preparation software.",
      "[S0562] SUNSPOT: SUNSPOT malware was designed and used to insert SUNBURST into software builds of the SolarWinds Orion IT management product.",
      "[G0034] Sandworm Team: Sandworm Team has distributed NotPetya by compromising the legitimate Ukrainian accounting software M.E.Doc and replacing a legitimate software update with a malicious one.",
      "[S0222] CCBkdr: CCBkdr was added to a legitimate, signed version 5.33 of the CCleaner software and distributed on CCleaner's distribution site.",
      "[G0035] Dragonfly: Dragonfly has placed trojanized installers for control system software on legitimate vendor app stores.",
      "[G0027] Threat Group-3390: Threat Group-3390 has compromised the Able Desktop installer to gain access to victim's environments.",
      "[G1034] Daggerfly: Daggerfly is associated with several supply chain compromises using malicious updates to compromise victims.",
      "[G1036] Moonstone Sleet: Moonstone Sleet has distributed a trojanized version of PuTTY software for initial access to victims.",
      "[C0024] SolarWinds Compromise: During the SolarWinds Compromise, APT29 gained initial network access to some victims via a trojanized update of SolarWinds Orion software.",
      "[G0046] FIN7: FIN7 has gained initial access by compromising a victim's software supply chain."
    ],
    "tactics": "TA0001 - Initial Access"
  },
  {
    "technique_id": "T1195.003",
    "technique_name": "Supply Chain Compromise: Compromise Hardware Supply Chain",
    "description": "Adversaries may manipulate hardware components in products prior to receipt by a final consumer for the purpose of data or system compromise. By modifying hardware or firmware in the supply chain, adversaries can insert a backdoor into consumer networks that may be difficult to detect and give the adversary a high degree of control over the system. Hardware backdoors may be inserted into various devices, such as servers, workstations, network infrastructure, or peripherals.",
    "detection": "Perform physical inspection of hardware to look for potential tampering. Perform integrity checking on pre-OS boot mechanisms that can be manipulated for malicious purposes.",
    "procedures": null,
    "tactics": "TA0001 - Initial Access"
  },
  {
    "technique_id": "T1199",
    "technique_name": "Trusted Relationship",
    "description": "Adversaries may breach or otherwise leverage organizations who have access to intended victims. Access through trusted third party relationship abuses an existing connection that may not be protected or receives less scrutiny than standard mechanisms of gaining access to a network. Organizations often grant elevated access to second or third-party external providers in order to allow them to manage internal systems as well as cloud-based environments. Some examples of these relationships include IT services contractors, managed security providers, infrastructure contractors (e.g. HVAC, elevators, physical security). The third-party provider's access may be intended to be limited to the infrastructure being maintained, but may exist on the same network as the rest of the enterprise. As such, Valid Accounts used by the other party for access to internal network systems may be compromised and used. In Office 365 environments, organizations may grant Microsoft partners or resellers delegated administrator permissions. By compromising a partner or reseller account, an adversary may be able to leverage existing delegated administrator relationships or send new delegated administrator offers to clients in order to gain administrative control over the victim tenant.",
    "detection": "Establish monitoring for activity conducted by second and third party providers and other trusted entities that may be leveraged as a means to gain access to the network. Depending on the type of relationship, an adversary may have access to significant amounts of information about the target before conducting an operation, especially if the trusted relationship is based on IT services. Adversaries may be able to act quickly towards an objective, so proper monitoring for behavior related to Credential Access, Lateral Movement, and Collection will be important to detect the intrusion.",
    "procedures": [
      "[G0115] GOLD SOUTHFIELD: GOLD SOUTHFIELD has breached Managed Service Providers (MSP's) to deliver malware to MSP customers.",
      "[G0007] APT28: Once APT28 gained access to the DCCC network, the group then proceeded to use that access to compromise the DNC network.",
      "[G0027] Threat Group-3390: Threat Group-3390 has compromised third party service providers to gain access to victim's environments.",
      "[G0034] Sandworm Team: Sandworm Team has used dedicated network connections from one victim organization to gain unauthorized access to a separate organization. Additionally, Sandworm Team has accessed Internet service providers and telecommunication entities that provide mobile connectivity.",
      "[G0045] menuPass: menuPass has used legitimate access granted to Managed Service Providers in order to access victims of interest.",
      "[C0024] SolarWinds Compromise: During the SolarWinds Compromise, APT29 gained access through compromised accounts at cloud solution partners, and used compromised certificates issued by Mimecast to authenticate to Mimecast customer systems.",
      "[G1039] RedCurl: RedCurl has gained access to a contractor to pivot to the victim’s infrastructure.",
      "[G0016] APT29: APT29 has compromised IT, cloud services, and managed services providers to gain broad access to multiple customers for subsequent operations.",
      "[G1005] POLONIUM: POLONIUM has used compromised credentials from an IT company to target downstream customers including a law firm and aviation company.",
      "[G0125] HAFNIUM: HAFNIUM has used stolen API keys and credentials associatd with privilege access management (PAM), cloud app providers, and cloud data management companies to access downstream customer environments.",
      "[G1004] LAPSUS$: LAPSUS$ has accessed internet-facing identity providers such as Azure Active Directory and Okta to target specific organizations.",
      "[G1041] Sea Turtle: Sea Turtle targeted third-party entities in trusted relationships with primary targets to ultimately achieve access at primary targets. Entities targeted included DNS registrars, telecommunication companies, and internet service providers."
    ],
    "tactics": "TA0001 - Initial Access"
  },
  {
    "technique_id": "T1200",
    "technique_name": "Hardware Additions",
    "description": "Adversaries may physically introduce computer accessories, networking hardware, or other computing devices into a system or network that can be used as a vector to gain access. Rather than just connecting and distributing payloads via removable storage (i.e. Replication Through Removable Media), more robust hardware additions can be used to introduce new functionalities and/or features into a system that can then be abused. While public references of usage by threat actors are scarce, many red teams/penetration testers leverage hardware additions for initial access. Commercial and open source products can be leveraged with capabilities such as passive network tapping, network traffic modification (i.e. Adversary-in-the-Middle), keystroke injection, kernel memory reading via DMA, addition of new wireless access points to an existing network, and others.",
    "detection": "Asset management systems may help with the detection of computer systems or network devices that should not exist on a network. Endpoint sensors may be able to detect the addition of hardware via USB, Thunderbolt, and other external device communication ports.",
    "procedures": [
      "[G0105] DarkVishnya: DarkVishnya physically connected Bash Bunny, Raspberry Pi, netbooks, and inexpensive laptops to the target organization's environment to access the company’s local network."
    ],
    "tactics": "TA0001 - Initial Access"
  },
  {
    "technique_id": "T1566.001",
    "technique_name": "Phishing: Spearphishing Attachment",
    "description": "Adversaries may send spearphishing emails with a malicious attachment in an attempt to gain access to victim systems. Spearphishing attachment is a specific variant of spearphishing. Spearphishing attachment is different from other forms of spearphishing in that it employs the use of malware attached to an email. All forms of spearphishing are electronically delivered social engineering targeted at a specific individual, company, or industry. In this scenario, adversaries attach a file to the spearphishing email and usually rely upon User Execution to gain execution. Spearphishing may also involve social engineering techniques, such as posing as a trusted source. There are many options for the attachment such as Microsoft Office documents, executables, PDFs, or archived files. Upon opening the attachment (and potentially clicking past protections), the adversary's payload exploits a vulnerability or directly executes on the user's system. The text of the spearphishing email usually tries to give a plausible reason why the file should be opened, and may explain how to bypass system protections in order to do so. The email may also contain instructions on how to decrypt an attachment, such as a zip file password, in order to evade email boundary defenses. Adversaries frequently manipulate file extensions and icons in order to make attached executables appear to be document files, or files exploiting one application appear to be a file for a different one.",
    "detection": "Network intrusion detection systems and email gateways can be used to detect spearphishing with malicious attachments in transit. Detonation chambers may also be used to identify malicious attachments. Solutions can be signature and behavior based, but adversaries may construct attachments in a way to avoid these systems. Filtering based on DKIM+SPF or header analysis can help detect when the email sender is spoofed. Anti-virus can potentially detect malicious documents and attachments as they're scanned to be stored on the email server or on the user's computer. Endpoint sensing or network sensing can potentially detect malicious events once the attachment is opened (such as a Microsoft Word document or PDF reaching out to the internet or spawning Powershell.exe) for techniques such as Exploitation for Client Execution or usage of malicious scripts. Monitor for suspicious descendant process spawning from Microsoft Office and other productivity software.",
    "procedures": [
      "[G0080] Cobalt Group: Cobalt Group has sent spearphishing emails with various attachment types to corporate and personal email accounts of victim organizations. Attachment types have included .rtf, .doc, .xls, archives containing LNK files, and password protected archives containing .exe and .scr executables.",
      "[S0669] KOCTOPUS: KOCTOPUS has been distributed via spearphishing emails with malicious attachments.",
      "[C0028] 2015 Ukraine Electric Power Attack: During the 2015 Ukraine Electric Power Attack, Sandworm Team obtained their initial foothold into many IT systems using Microsoft Office attachments delivered through phishing emails.",
      "[S0447] Lokibot: Lokibot is delivered via a malicious XLS attachment contained within a spearhpishing email.",
      "[G0032] Lazarus Group: Lazarus Group has targeted victims with spearphishing emails containing malicious Microsoft Word documents.",
      "[G1031] Saint Bear: Saint Bear uses a variety of file formats, such as Microsoft Office documents, ZIP archives, PDF documents, and other items as phishing attachments for initial access.",
      "[S0331] Agent Tesla: The primary delivered mechanism for Agent Tesla is through email phishing messages.",
      "[G0081] Tropic Trooper: Tropic Trooper sent spearphishing emails that contained malicious Microsoft Office and fake installer file attachments.",
      "[G0037] FIN6: FIN6 has targeted victims with e-mails containing malicious attachments.",
      "[S1064] SVCReady: SVCReady has been distributed via spearphishing campaigns containing malicious Mircrosoft Word documents.",
      "[G0007] APT28: APT28 sent spearphishing emails containing malicious Microsoft Office and RAR attachments.",
      "[S1066] DarkTortilla: DarkTortilla has been distributed via spearphishing emails containing archive attachments, with file types such as .iso, .zip, .img, .dmg, and .tar, as well as through malicious documents.",
      "[G0018] admin@338: admin@338 has sent emails with malicious Microsoft Office documents attached.",
      "[G0112] Windshift: Windshift has sent spearphishing emails with attachment to harvest credentials and deliver malware.",
      "[G0060] BRONZE BUTLER: BRONZE BUTLER used spearphishing emails with malicious Microsoft Word attachments to infect victims.",
      "[G0090] WIRTE: WIRTE has sent emails to intended victims with malicious MS Word and Excel attachments.",
      "[G0069] MuddyWater: MuddyWater has compromised third parties and used compromised accounts to send spearphishing emails with targeted attachments to recipients.",
      "[G0045] menuPass: menuPass has sent malicious Office documents via email as part of spearphishing campaigns as well as executables disguised as documents.",
      "[S0428] PoetRAT: PoetRAT was distributed via malicious Word documents.",
      "[S0148] RTM: RTM has been delivered via spearphishing attachments disguised as PDF documents.",
      "[G0027] Threat Group-3390: Threat Group-3390 has used e-mail to deliver malicious attachments to victims.",
      "[G0047] Gamaredon Group: Gamaredon Group has delivered spearphishing emails with malicious attachments to targets.",
      "[S0622] AppleSeed: AppleSeed has been distributed to victims through malicious e-mail attachments.",
      "[S0458] Ramsay: Ramsay has been distributed through spearphishing emails with malicious attachments.",
      "[G0050] APT32: APT32 has sent spearphishing emails with a malicious executable disguised as a document or spreadsheet.",
      "[G0012] Darkhotel: Darkhotel has sent spearphishing emails with malicious RAR and .LNK attachments.",
      "[G1002] BITTER: BITTER has sent spearphishing emails with a malicious RTF document or Excel spreadsheet.",
      "[G0016] APT29: APT29 has used spearphishing emails with an attachment to deliver files with exploits to initial victims.",
      "[S0011] Taidoor: Taidoor has been delivered through spearphishing emails.",
      "[S0585] Kerrdown: Kerrdown has been distributed through malicious e-mail attachments.",
      "[G0100] Inception: Inception has used weaponized documents attached to spearphishing emails for reconnaissance and initial compromise.",
      "[C0001] Frankenstein: During Frankenstein, the threat actors likely used spearphishing emails to send malicious Microsoft Word documents.",
      "[S0455] Metamorfo: Metamorfo has been delivered to victims via emails with malicious HTML attachments.",
      "[G1011] EXOTIC LILY: EXOTIC LILY conducted an e-mail thread-hijacking campaign with malicious ISO attachments.",
      "[G0130] Ajax Security Team: Ajax Security Team has used personalized spearphishing attachments.",
      "[S0631] Chaes: Chaes has been delivered by sending victims a phishing email containing a malicious .docx file.",
      "[G0035] Dragonfly: Dragonfly has sent emails with malicious attachments to gain initial access.",
      "[G0034] Sandworm Team: Sandworm Team has delivered malicious Microsoft Office and ZIP file attachments via spearphishing emails.",
      "[G0066] Elderwood: Elderwood has delivered zero-day exploits and malware to victims via targeted emails containing malicious attachments.",
      "[C0015] C0015: For C0015, security researchers assessed the threat actors likely used a phishing campaign to distribute a weaponized attachment to victims.",
      "[G0064] APT33: APT33 has sent spearphishing e-mails with archive attachments.",
      "[S1160] Latrodectus: Latrodectus has been distributed through reply-chain phishing emails with malicious attachments.",
      "[S0499] Hancitor: Hancitor has been delivered via phishing emails with malicious attachments.",
      "[G0021] Molerats: Molerats has sent phishing emails with malicious Microsoft Word and PDF attachments.",
      "[G0040] Patchwork: Patchwork has used spearphishing with an attachment to deliver files with exploits to initial victims.",
      "[G0127] TA551: TA551 has sent spearphishing attachments with password protected ZIP files.",
      "[G0048] RTM: RTM has used spearphishing attachments to distribute its malware.",
      "[G1039] RedCurl: RedCurl has used phishing emails with malicious files to gain initial access.",
      "[G0096] APT41: APT41 sent spearphishing emails with attachments such as compiled HTML (.chm) files to initially compromise their victims.",
      "[G1035] Winter Vivern: Winter Vivern leverages malicious attachments delivered via email for initial access activity.",
      "[G0126] Higaisa: Higaisa has sent spearphishing emails containing malicious attachments.",
      "[S0660] Clambling: Clambling has been delivered to victim's machines through malicious e-mail attachments.",
      "[S0634] EnvyScout: EnvyScout has been distributed via spearphishing as an email attachment.",
      "[S1030] Squirrelwaffle: Squirrelwaffle has been distributed via malicious Microsoft Office documents within spam emails.",
      "[G0142] Confucius: Confucius has crafted and sent victims malicious attachments to gain initial access.",
      "[S0373] Astaroth: Astaroth has been delivered via malicious e-mail attachments.",
      "[C0016] Operation Dust Storm: During Operation Dust Storm, the threat actors sent spearphishing emails that contained a malicious Microsoft Word document.",
      "[S1014] DanBot: DanBot has been distributed within a malicious Excel attachment via spearphishing emails.",
      "[C0037] Water Curupira Pikabot Distribution: Water Curupira Pikabot Distribution attached password-protected ZIP archives to deliver Pikabot installers.",
      "[S1183] StrelaStealer: StrelaStealer has been distributed as a spearphishing attachment.",
      "[S0670] WarzoneRAT: WarzoneRAT has been distributed as a malicious attachment within an email.",
      "[G0062] TA459: TA459 has targeted victims using spearphishing emails with malicious Microsoft Word attachments.",
      "[G0098] BlackTech: BlackTech has used spearphishing e-mails with malicious password-protected archived files (ZIP or RAR) to deliver malware.",
      "[G0078] Gorgon Group: Gorgon Group sent emails to victims with malicious Microsoft Office documents attached.",
      "[G0065] Leviathan: Leviathan has sent spearphishing emails with malicious attachments, including .rtf, .doc, and .xls files.",
      "[G0103] Mofang: Mofang delivered spearphishing emails with malicious documents, PDFs, or Excel files attached.",
      "[S1086] Snip3: Snip3 has been delivered to victims through malicious e-mail attachments.",
      "[S0433] Rifdoor: Rifdoor has been distributed in e-mails with malicious Excel or Word documents.",
      "[S0476] Valak: Valak has been delivered via spearphishing e-mails with password protected ZIP files.",
      "[G0019] Naikon: Naikon has used malicious e-mail attachments to deliver malware.",
      "[G0005] APT12: APT12 has sent emails with malicious Microsoft Office documents and PDFs attached.",
      "[S0234] Bandook: Bandook is delivered via a malicious Word document inside a zip file.",
      "[G0073] APT19: APT19 sent spearphishing emails with malicious attachments in RTF and XLSM formats to deliver initial exploits.",
      "[S0240] ROKRAT: ROKRAT has been delivered via spearphishing emails that contain a malicious Hangul Office or Microsoft Word document.",
      "[C0011] C0011: During C0011, Transparent Tribe sent malicious attachments via email to student targets in India.",
      "[G1033] Star Blizzard: Star Blizzard has sent emails with malicious .pdf files to spread malware.",
      "[C0005] Operation Spalax: During Operation Spalax, the threat actors sent phishing emails that included a PDF document that in some cases led to the download and execution of malware.",
      "[G0013] APT30: APT30 has used spearphishing emails with malicious DOC attachments.",
      "[G0137] Ferocious Kitten: Ferocious Kitten has conducted spearphishing campaigns containing malicious documents to lure victims to open the attachments.",
      "[G1026] Malteiro: Malteiro has sent spearphishing emails containing malicious .zip files.",
      "[G1008] SideCopy: SideCopy has sent spearphishing emails with malicious hta file attachments.",
      "[S1207] XLoader: XLoader has been delivered as a phishing attachment, including PDFs with embedded links, Word and Excel files, and various archive files (ZIP, RAR, ACE, and ISOs) containing EXE payloads.",
      "[C0022] Operation Dream Job: During Operation Dream Job, Lazarus Group sent emails with malicious attachments to gain unauthorized access to targets' computers.",
      "[S0268] Bisonal: Bisonal has been delivered as malicious email attachments.",
      "[G0061] FIN8: FIN8 has distributed targeted emails containing Word documents with embedded malicious macros.",
      "[G0133] Nomadic Octopus: Nomadic Octopus has targeted victims with spearphishing emails containing malicious attachments.",
      "[G0140] LazyScripter: LazyScripter has used spam emails weaponized with archive or document files as its initial infection vector.",
      "[G0129] Mustang Panda: Mustang Panda has used spearphishing attachments to deliver initial access payloads.",
      "[S1065] Woody RAT: Woody RAT has been delivered via malicious Word documents and archive files.",
      "[G0049] OilRig: OilRig has sent spearphising emails with malicious attachments to potential victims using compromised and/or spoofed email accounts.",
      "[C0047] RedDelta Modified PlugX Infection Chain Operations: Mustang Panda leveraged malicious attachments in spearphishing emails for initial access to victim environments in RedDelta Modified PlugX Infection Chain Operations.",
      "[G1036] Moonstone Sleet: Moonstone Sleet delivered various payloads to victims as spearphishing attachments.",
      "[S0496] REvil: REvil has been distributed via malicious e-mail attachments including MS Word Documents.",
      "[S0648] JSS Loader: JSS Loader has been delivered by phishing emails containing malicious Microsoft Excel attachments.",
      "[S0642] BADFLICK: BADFLICK has been distributed via spearphishing campaigns containing malicious Microsoft Word documents.",
      "[S0356] KONNI: KONNI has been delivered via spearphishing campaigns through a malicious Word document.",
      "[G0134] Transparent Tribe: Transparent Tribe has sent spearphishing e-mails with attachments to deliver malicious payloads.",
      "[S1111] DarkGate: DarkGate can be distributed through emails with malicious attachments from a spoofed email address.",
      "[S0483] IcedID: IcedID has been delivered via phishing e-mails with malicious attachments.",
      "[S0673] DarkWatchman: DarkWatchman has been delivered via spearphishing emails that contain a malicious zip file.",
      "[G0094] Kimsuky: Kimsuky has used emails containing Word, Excel and/or HWP (Hangul Word Processor) documents in their spearphishing campaigns.",
      "[G0095] Machete: Machete has delivered spearphishing emails that contain a zipped file with malicious contents.",
      "[S0650] QakBot: QakBot has spread through emails with malicious attachments.",
      "[G0085] FIN4: FIN4 has used spearphishing emails containing attachments (which are often stolen, legitimate documents sent from compromised accounts) with embedded malicious macros.",
      "[S0340] Octopus: Octopus has been delivered via spearsphishing emails.",
      "[G0102] Wizard Spider: Wizard Spider has used spearphishing attachments to deliver Microsoft documents containing macros or PDFs containing malicious links to download either Emotet, Bokbot, TrickBot, or Bazar.",
      "[S1017] OutSteel: OutSteel has been distributed as a malicious attachment within a spearphishing email.",
      "[S1039] Bumblebee: Bumblebee has gained execution through luring users into opening malicious attachments.",
      "[S1018] Saint Bot: Saint Bot has been distributed as malicious attachments within spearphishing emails.",
      "[G0138] Andariel: Andariel has conducted spearphishing campaigns that included malicious Word or Excel attachments.",
      "[G1018] TA2541: TA2541 has sent phishing emails with malicious attachments for initial access including MS Word documents.",
      "[S0665] ThreatNeedle: ThreatNeedle has been distributed via a malicious Word document within a spearphishing email.",
      "[G0131] Tonto Team: Tonto Team has delivered payloads via spearphishing attachments.",
      "[S0453] Pony: Pony has been delivered via spearphishing attachments.",
      "[G0121] Sidewinder: Sidewinder has sent e-mails with malicious attachments often crafted for specific targets.",
      "[S0367] Emotet: Emotet has been delivered by phishing emails containing attachments.",
      "[G0092] TA505: TA505 has used spearphishing emails with malicious attachments to initially compromise victims.",
      "[G0046] FIN7: FIN7 sent spearphishing emails with either malicious Microsoft Documents or RTF files attached.",
      "[G0067] APT37: APT37 delivers malware using spearphishing emails with malicious HWP attachments.",
      "[S1013] ZxxZ: ZxxZ has been distributed via spearphishing emails, usually containing a malicious RTF or Excel attachment.",
      "[S0528] Javali: Javali has been delivered as malicious e-mail attachments.",
      "[G1012] CURIUM: CURIUM has used phishing with malicious attachments for initial access to victim environments.",
      "[S1075] KOPILUWAK: KOPILUWAK has been delivered to victims as a malicious email attachment.",
      "[G0091] Silence: Silence has sent emails with malicious DOCX, CHM, LNK and ZIP attachments.",
      "[S0696] Flagpro: Flagpro has been distributed via spearphishing as an email attachment.",
      "[S0520] BLINDINGCAN: BLINDINGCAN has been delivered by phishing emails containing malicious Microsoft Office documents.",
      "[G0136] IndigoZebra: IndigoZebra sent spearphishing emails containing malicious password-protected RAR attachments.",
      "[G0006] APT1: APT1 has sent spearphishing emails containing malicious attachments.",
      "[G0082] APT38: APT38 has conducted spearphishing campaigns using malicious email attachments.",
      "[G0079] DarkHydrus: DarkHydrus has sent spearphishing emails with password-protected RAR archives containing malicious Excel Web Query files (.iqy). The group has also sent spearphishing emails that contained malicious Microsoft Office documents that use the “attachedTemplate” technique to load a template from a remote server.",
      "[G0089] The White Company: The White Company has sent phishing emails with malicious Microsoft Word attachments to victims.",
      "[S0198] NETWIRE: NETWIRE has been spread via e-mail campaigns utilizing malicious attachments.",
      "[G0068] PLATINUM: PLATINUM has sent spearphishing emails with attachments to victims as its primary initial access vector.",
      "[S1213] Lumma Stealer: Lumma Stealer has been delivered through phishing emails with malicious attachments.",
      "[G0075] Rancor: Rancor has attached a malicious document to an email to gain initial access.",
      "[G0099] APT-C-36: APT-C-36 has used spearphishing emails with password protected RAR attachment to avoid being detected by the email gateway.",
      "[G0087] APT39: APT39 leveraged spearphishing emails with malicious attachments to initially compromise victims.",
      "[S0346] OceanSalt: OceanSalt has been delivered via spearphishing emails with Microsoft Office attachments.",
      "[G0084] Gallmaker: Gallmaker sent emails with malicious Microsoft Office documents attached.",
      "[S0266] TrickBot: TrickBot has used an email with an Excel sheet containing a malicious macro to deploy the malware"
    ],
    "tactics": "TA0001 - Initial Access"
  },
  {
    "technique_id": "T1566.002",
    "technique_name": "Phishing: Spearphishing Link",
    "description": "Adversaries may send spearphishing emails with a malicious link in an attempt to gain access to victim systems. Spearphishing with a link is a specific variant of spearphishing. It is different from other forms of spearphishing in that it employs the use of links to download malware contained in email, instead of attaching malicious files to the email itself, to avoid defenses that may inspect email attachments. Spearphishing may also involve social engineering techniques, such as posing as a trusted source. All forms of spearphishing are electronically delivered social engineering targeted at a specific individual, company, or industry. In this case, the malicious emails contain links. Generally, the links will be accompanied by social engineering text and require the user to actively click or copy and paste a URL into a browser, leveraging User Execution. The visited website may compromise the web browser using an exploit, or the user will be prompted to download applications, documents, zip files, or even executables depending on the pretext for the email in the first place. Adversaries may also include links that are intended to interact directly with an email reader, including embedded images intended to exploit the end system directly. Additionally, adversaries may use seemingly benign links that abuse special characters to mimic legitimate websites (known as an \"IDN homograph attack\"). URLs may also be obfuscated by taking advantage of quirks in the URL schema, such as the acceptance of integer- or hexadecimal-based hostname formats and the automatic discarding of text before an “@” symbol: for example, `hxxp://google.com@1157586937`. Adversaries may also utilize links to perform consent phishing, typically with OAuth 2.0 request URLs that when accepted by the user provide permissions/access for malicious applications, allowing adversaries to Steal Application Access Tokens. These stolen access tokens allow the adversary to perform various actions on behalf of the user via API calls. Adversaries may also utilize spearphishing links to Steal Application Access Tokens that grant immediate access to the victim environment. For example, a user may be lured through “consent phishing” into granting adversaries permissions/access via a malicious OAuth 2.0 request URL . Similarly, malicious links may also target device-based authorization, such as OAuth 2.0 device authorization grant flow which is typically used to authenticate devices without UIs/browsers. Known as “device code phishing,” an adversary may send a link that directs the victim to a malicious authorization page where the user is tricked into entering a code/credentials that produces a device token.",
    "detection": "URL inspection within email (including expanding shortened links) can help detect links leading to known malicious sites as well as links redirecting to adversary infrastructure based by upon suspicious OAuth patterns with unusual TLDs.. Detonation chambers can be used to detect these links and either automatically go to these sites to determine if they're potentially malicious, or wait and capture the content if a user visits the link. Filtering based on DKIM+SPF or header analysis can help detect when the email sender is spoofed. Because this technique usually involves user interaction on the endpoint, many of the possible detections take place once User Execution occurs.",
    "procedures": [
      "[G0098] BlackTech: BlackTech has used spearphishing e-mails with links to cloud services to deliver malware.",
      "[S0585] Kerrdown: Kerrdown has been distributed via e-mails containing a malicious link.",
      "[G0069] MuddyWater: MuddyWater has sent targeted spearphishing e-mails with malicious links.",
      "[G1014] LuminousMoth: LuminousMoth has sent spearphishing emails containing a malicious Dropbox download link.",
      "[G0142] Confucius: Confucius has sent malicious links to victims through email campaigns.",
      "[G0103] Mofang: Mofang delivered spearphishing emails with malicious links included.",
      "[G0094] Kimsuky: Kimsuky has sent spearphishing emails containing a link to a document that contained malicious macros or took the victim to an actor-controlled domain.",
      "[G0121] Sidewinder: Sidewinder has sent e-mails with malicious links often crafted for specific targets.",
      "[S0561] GuLoader: GuLoader has been spread in phishing campaigns using malicious web links.",
      "[S1017] OutSteel: OutSteel has been distributed through malicious links contained within spearphishing emails.",
      "[C0002] Night Dragon: During Night Dragon, threat actors sent spearphishing emails containing links to compromised websites where malware was downloaded.",
      "[S0669] KOCTOPUS: KOCTOPUS has been distributed as a malicious link within an email.",
      "[G0066] Elderwood: Elderwood has delivered zero-day exploits and malware to victims via targeted emails containing a link to malicious content hosted on an uncommon Web server.",
      "[S0528] Javali: Javali has been delivered via malicious links embedded in e-mails.",
      "[S1111] DarkGate: DarkGate is distributed in phishing emails containing links to distribute malicious VBS or MSI files. DarkGate uses applications such as Microsoft Teams for distributing links to payloads.",
      "[S1030] Squirrelwaffle: Squirrelwaffle has been distributed through phishing emails containing a malicious URL.",
      "[G0095] Machete: Machete has sent phishing emails that contain a link to an external server with ZIP and RAR archives.",
      "[S0584] AppleJeus: AppleJeus has been distributed via spearphishing link.",
      "[G0046] FIN7: FIN7 has conducted broad phishing campaigns using malicious links.",
      "[S0367] Emotet: Emotet has been delivered by phishing emails containing links.",
      "[C0005] Operation Spalax: During Operation Spalax, the threat actors sent phishing emails to victims that contained a malicious link.",
      "[G1020] Mustard Tempest: Mustard Tempest has sent victims emails containing links to compromised websites.",
      "[G0034] Sandworm Team: Sandworm Team has crafted phishing emails containing malicious hyperlinks.",
      "[G0134] Transparent Tribe: Transparent Tribe has embedded links to malicious downloads in e-mails.",
      "[G0120] Evilnum: Evilnum has sent spearphishing emails containing a link to a zip file hosted on Google Drive.",
      "[S1122] Mispadu: Mispadu has been spread via malicious links embedded in emails.",
      "[S0646] SpicyOmelette: SpicyOmelette has been distributed via emails containing a malicious link that appears to be a PDF document.",
      "[G0129] Mustang Panda: Mustang Panda has delivered malicious links to their intended targets.",
      "[G0061] FIN8: FIN8 has distributed targeted emails containing links to malicious documents with embedded macros.",
      "[G0050] APT32: APT32 has sent spearphishing emails containing malicious links.",
      "[S0453] Pony: Pony has been delivered via spearphishing emails which contained malicious links.",
      "[G0022] APT3: APT3 has sent spearphishing emails containing malicious links.",
      "[G0006] APT1: APT1 has sent spearphishing emails containing hyperlinks to malicious files.",
      "[G0032] Lazarus Group: Lazarus Group has sent malicious links to victims via email.",
      "[G0065] Leviathan: Leviathan has sent spearphishing emails with links, often using a fraudulent lookalike domain and stolen branding.",
      "[S1018] Saint Bot: Saint Bot has been distributed through malicious links contained within spearphishing emails.",
      "[G0064] APT33: APT33 has sent spearphishing emails containing links to .hta files.",
      "[G0128] ZIRCONIUM: ZIRCONIUM has used malicious links in e-mails to deliver malware.",
      "[G1011] EXOTIC LILY: EXOTIC LILY has relied on victims to open malicious links in e-mails for execution.",
      "[S0677] AADInternals: AADInternals can send \"consent phishing\" emails containing malicious links designed to steal users’ access tokens.",
      "[S1039] Bumblebee: Bumblebee has been spread through e-mail campaigns with malicious links.",
      "[C0011] C0011: During C0011, Transparent Tribe sent emails containing a malicious link to student targets in India.",
      "[S0266] TrickBot: TrickBot has been delivered via malicious links in phishing e-mails.",
      "[G0021] Molerats: Molerats has sent phishing emails with malicious links included.",
      "[G0059] Magic Hound: Magic Hound has sent malicious URL links through email to victims. In some cases the URLs were shortened or linked to Word documents with malicious macros that executed PowerShells scripts to download Pupy.",
      "[S1124] SocGholish: SocGholish has been spread via emails containing malicious links.",
      "[G0049] OilRig: OilRig has sent spearphising emails with malicious links to potential victims.",
      "[G0112] Windshift: Windshift has sent spearphishing emails with links to harvest credentials and deliver malware.",
      "[C0047] RedDelta Modified PlugX Infection Chain Operations: Mustang Panda distributed malicious links in phishing emails leading to HTML files that would direct the victim to malicious MSC files if running Windows based on User Agent fingerprinting during RedDelta Modified PlugX Infection Chain Operations.",
      "[G0080] Cobalt Group: Cobalt Group has sent emails with URLs pointing to malicious documents.",
      "[S0198] NETWIRE: NETWIRE has been spread via e-mail campaigns utilizing malicious links.",
      "[G0016] APT29: APT29 has used spearphishing with a link to trick victims into clicking on a link to a zip file containing malicious files.",
      "[G0085] FIN4: FIN4 has used spearphishing emails (often sent from compromised accounts) containing malicious links.",
      "[C0021] C0021: During C0021, the threat actors sent phishing emails with unique malicious links, likely for tracking victim clicks.",
      "[S1086] Snip3: Snip3 has been delivered to victims through e-mail links to malicious files.",
      "[S0650] QakBot: QakBot has spread through emails with malicious links.",
      "[G1018] TA2541: TA2541 has used spearphishing e-mails with malicious links to deliver malware.",
      "[S0499] Hancitor: Hancitor has been delivered via phishing emails which contained malicious links.",
      "[S0534] Bazar: Bazar has been spread via emails with embedded malicious links.",
      "[G1006] Earth Lusca: Earth Lusca has sent spearphishing emails to potential targets that contained a malicious link.",
      "[G1039] RedCurl: RedCurl has used phishing emails with malicious links to gain initial access.",
      "[G1046] Storm-1811: Storm-1811 has distributed malicious links to victims that redirect to EvilProxy-based phishing sites to harvest credentials.",
      "[G0010] Turla: Turla attempted to trick targets into clicking on a link featuring a seemingly legitimate domain from Adobe.com to download their malware and gain initial access.",
      "[G0102] Wizard Spider: Wizard Spider has sent phishing emails containing a link to an actor-controlled Google Drive document or other free online file hosting services.",
      "[S1160] Latrodectus: Latrodectus has been distributed to victims through emails containing malicious links.",
      "[G1037] TA577: TA577 has sent emails containing links to malicious JavaScript files.",
      "[G0040] Patchwork: Patchwork has used spearphishing with links to deliver files with exploits to initial victims.",
      "[G0092] TA505: TA505 has sent spearphishing emails containing malicious links.",
      "[G0140] LazyScripter: LazyScripter has used spam emails that contain a link that redirects the victim to download a malicious document.",
      "[S0530] Melcoz: Melcoz has been spread through malicious links embedded in e-mails.",
      "[C0016] Operation Dust Storm: During Operation Dust Storm, the threat actors sent spearphishing emails containing a malicious link.",
      "[S0531] Grandoreiro: Grandoreiro has been spread via malicious links embedded in e-mails.",
      "[S0476] Valak: Valak has been delivered via malicious links in e-mail.",
      "[G1044] APT42: APT42 has sent spearphishing emails containing malicious links.",
      "[G0087] APT39: APT39 leveraged spearphishing emails with malicious links to initially compromise victims.",
      "[S1213] Lumma Stealer: Lumma Stealer has been delivered through phishing emails containing malicious links.",
      "[C0022] Operation Dream Job: During Operation Dream Job, Lazarus Group sent malicious OneDrive links with fictitious job offer advertisements via email.",
      "[C0036] Pikabot Distribution February 2024: Pikabot Distribution February 2024 utilized emails with hyperlinks leading to malicious ZIP archive files containing scripts to download and install Pikabot."
    ],
    "tactics": "TA0001 - Initial Access"
  },
  {
    "technique_id": "T1566.003",
    "technique_name": "Phishing: Spearphishing via Service",
    "description": "Adversaries may send spearphishing messages via third-party services in an attempt to gain access to victim systems. Spearphishing via service is a specific variant of spearphishing. It is different from other forms of spearphishing in that it employs the use of third party services rather than directly via enterprise email channels. All forms of spearphishing are electronically delivered social engineering targeted at a specific individual, company, or industry. In this scenario, adversaries send messages through various social media services, personal webmail, and other non-enterprise controlled services. These services are more likely to have a less-strict security policy than an enterprise. As with most kinds of spearphishing, the goal is to generate rapport with the target or get the target's interest in some way. Adversaries will create fake social media accounts and message employees for potential job opportunities. Doing so allows a plausible reason for asking about services, policies, and software that's running in an environment. The adversary can then send malicious links or attachments through these services. A common example is to build rapport with a target via social media, then send content to a personal webmail service that the target uses on their work computer. This allows an adversary to bypass some email restrictions on the work account, and the target is more likely to open the file since it's something they were expecting. If the payload doesn't work as expected, the adversary can continue normal communications and troubleshoot with the target on how to get it working.",
    "detection": "Because most common third-party services used for spearphishing via service leverage TLS encryption, SSL/TLS inspection is generally required to detect the initial communication/delivery. With SSL/TLS inspection intrusion detection signatures or other security gateway appliances may be able to detect malware. Anti-virus can potentially detect malicious documents and files that are downloaded on the user's computer. Endpoint sensing or network sensing can potentially detect malicious events once the file is opened (such as a Microsoft Word document or PDF reaching out to the internet or spawning Powershell.exe) for techniques such as Exploitation for Client Execution or usage of malicious scripts.",
    "procedures": [
      "[G1012] CURIUM: CURIUM has used social media to deliver malicious files to victims.",
      "[G0112] Windshift: Windshift has used fake personas on social media to engage and target victims.",
      "[G0130] Ajax Security Team: Ajax Security Team has used various social media channels to spearphish victims.",
      "[G1011] EXOTIC LILY: EXOTIC LILY has used the e-mail notification features of legitimate file sharing services for spearphishing.",
      "[S1100] Ninja: Ninja has been distributed to victims via the messaging app Telegram.",
      "[G1022] ToddyCat: ToddyCat has sent loaders configured to run Ninja as zip archives via Telegram.",
      "[C0022] Operation Dream Job: During Operation Dream Job, Lazarus Group sent victims spearphishing messages via LinkedIn concerning fictitious jobs.",
      "[G0037] FIN6: FIN6 has used fake job advertisements sent via LinkedIn to spearphish targets.",
      "[G0016] APT29: APT29 has used the legitimate mailing service Constant Contact to send phishing e-mails.",
      "[G0049] OilRig: OilRig has used LinkedIn to send spearphishing links.",
      "[G0070] Dark Caracal: Dark Caracal spearphished victims via Facebook and Whatsapp.",
      "[G0032] Lazarus Group: Lazarus Group has used social media platforms, including LinkedIn and Twitter, to send spearphishing messages.",
      "[G1046] Storm-1811: Storm-1811 has used Microsoft Teams to send messages and initiate voice calls to victims posing as IT support personnel.",
      "[G0059] Magic Hound: Magic Hound used various social media channels (such as LinkedIn) as well as messaging services (such as WhatsApp) to spearphish victims.",
      "[G1036] Moonstone Sleet: Moonstone Sleet has used social media services to spear phish victims to deliver trojainized software."
    ],
    "tactics": "TA0001 - Initial Access"
  },
  {
    "technique_id": "T1566.004",
    "technique_name": "Phishing: Spearphishing Voice",
    "description": "Adversaries may use voice communications to ultimately gain access to victim systems. Spearphishing voice is a specific variant of spearphishing. It is different from other forms of spearphishing in that is employs the use of manipulating a user into providing access to systems through a phone call or other forms of voice communications. Spearphishing frequently involves social engineering techniques, such as posing as a trusted source (ex: Impersonation) and/or creating a sense of urgency or alarm for the recipient. All forms of phishing are electronically delivered social engineering. In this scenario, adversaries are not directly sending malware to a victim vice relying on User Execution for delivery and execution. For example, victims may receive phishing messages that instruct them to call a phone number where they are directed to visit a malicious URL, download malware, or install adversary-accessible remote management tools (Remote Access Tools) onto their computer. Adversaries may also combine voice phishing with Multi-Factor Authentication Request Generation in order to trick users into divulging MFA credentials or accepting authentication prompts.",
    "detection": null,
    "procedures": [
      "[G1046] Storm-1811: Storm-1811 has initiated voice calls with victims posing as IT support to prompt users to download and execute scripts and other tools for initial access.",
      "[C0027] C0027: During C0027, Scattered Spider impersonated legitimate IT personnel in phone calls to direct victims to download a remote monitoring and management (RMM) tool that would allow the adversary to remotely control their system."
    ],
    "tactics": "TA0001 - Initial Access"
  },
  {
    "technique_id": "T1659",
    "technique_name": "Content Injection",
    "description": "Adversaries may gain access and continuously communicate with victims by injecting malicious content into systems through online network traffic. Rather than luring victims to malicious payloads hosted on a compromised website (i.e., Drive-by Target followed by Drive-by Compromise), adversaries may initially access victims through compromised data-transfer channels where they can manipulate traffic and/or inject their own content. These compromised online network channels may also be used to deliver additional payloads (i.e., Ingress Tool Transfer) and other data to already compromised systems. Adversaries may inject content to victim systems in various ways, including: * From the middle, where the adversary is in-between legitimate online client-server communications (**Note:** this is similar but distinct from Adversary-in-the-Middle, which describes AiTM activity solely within an enterprise environment) * From the side, where malicious content is injected and races to the client as a fake response to requests of a legitimate online server Content injection is often the result of compromised upstream communication channels, for example at the level of an internet service provider (ISP) as is the case with \"lawful interception.\"",
    "detection": null,
    "procedures": [
      "[S1088] Disco: Disco has achieved initial access and execution through content injection into DNS, HTTP, and SMB replies to targeted hosts that redirect them to download malicious files.",
      "[G1019] MoustachedBouncer: MoustachedBouncer has injected content into DNS, HTTP, and SMB replies to redirect specifically-targeted victims to a fake Windows Update page to download malware."
    ],
    "tactics": "TA0001 - Initial Access"
  },
  {
    "technique_id": "T1669",
    "technique_name": "Wi-Fi Networks",
    "description": "Adversaries may gain initial access to target systems by connecting to wireless networks. They may accomplish this by exploiting open Wi-Fi networks used by target devices or by accessing secured Wi-Fi networks — requiring Valid Accounts — belonging to a target organization. Establishing a connection to a Wi-Fi access point requires a certain level of proximity to both discover and maintain a stable network connection. Adversaries may establish a wireless connection through various methods, such as by physically positioning themselves near a Wi-Fi network to conduct close access operations. To bypass the need for physical proximity, adversaries may attempt to remotely compromise nearby third-party systems that have both wired and wireless network connections available (i.e., dual-homed systems). These third-party compromised devices can then serve as a bridge to connect to a target’s Wi-Fi network. Once an initial wireless connection is achieved, adversaries may leverage this access for follow-on activities in the victim network or further targeting of specific devices on the network. Adversaries may perform Network Sniffing or Adversary-in-the-Middle activities for Credential Access or Discovery.",
    "detection": null,
    "procedures": [
      "[G0007] APT28: APT28 has exploited open Wi-Fi access points for initial access to target devices using the network.",
      "[C0051] APT28 Nearest Neighbor Campaign: During APT28 Nearest Neighbor Campaign, APT28 established wireless connections to secure, enterprise Wi-Fi networks belonging to a target organization for initial access into the environment."
    ],
    "tactics": "TA0001 - Initial Access"
  }
]